/**
  * @file    KVB_LCD.h
  * @author  Boruzdov Konstantin
  * @version V1.0
  * @date    17-05-2026
  * @brief Cross-platform graphics library for ATmega128 and STM32F407
  * 
  * Copyright (C) 2026 [Boruzdov Konstantin / KVB]. All rights reserved.
  * 
  * Licensed under the Creative Commons Attribution-NonCommercial 4.0 
  * International License (CC BY-NC 4.0).
  * 
  * YOU MAY NOT USE THIS FILE FOR COMMERCIAL PURPOSES. КОММЕРЧЕСКОЕ ИСПОЛЬЗОВАНИЕ ЗАПРЕЩЕНО.
  * For commercial licensing licensing inquiries, please contact: email kboruzdov@mail.ru tel +7 965-363-45-29
  * 
  * Полный текст лицензии: https://creativecommons.org
  */
#ifndef __KVB_LCD_H
#define __KVB_LCD_H
//###########################################################################################
//									Подключаемые файлы
//###########################################################################################
#include "stm32f4xx_hal.h"
#include "stdio.h"
//###########################################################################################
#ifdef __cplusplus
extern "C" {
#endif
//###########################################################################################
//						Макрос переопределения имени задержки
//###########################################################################################
#define KVB_Delay(xx) HAL_Delay(xx)
//###########################################################################################
//						Пустой макрос для совместимости строк с AVR
//###########################################################################################
#define KVBMEM // пустой макрос
//###########################################################################################
//			Определяем универсальный 8-битный тип для совместимости шрифтов с AVR
//###########################################################################################
typedef uint8_t kvbu8_t;
//###########################################################################################
//						Макросы определения имен ориентации LCD панели
//###########################################################################################
#define PORTRAIT_UP		0//Вертикальная ориентация (Разъем сверху)
#define PORTRAIT_DOWN	1//Вертикальная ориентация (Разъем снизу)
#define LANDSCAPE_RIGHT	2//Горизонтальная ориентация (Разъем справа)
#define LANDSCAPE_LEFT	3//Горизонтальная ориентация (Разъем слева)
//###########################################################################################
//					Таблица основных цветов приложения в формате RGB565
//###########################################################################################
#define		BLACK			0X0000	//Черный				(00000 000000 00000)	(000000)
#define		WHITE			0XFFFF	//Белый					(11111 111111 11111)	(FFFFFF)
#define     RED				0XF800	//Красный				(11111 000000 00000)	(FF0000)
#define     LIME			0X07E0	//Зеленый				(00000 111111 00000)	(00FF00)
#define     BLUE			0X001F	//Синий					(00000 000000 11111)	(0000FF)
#define     YELLOW			0XFFE0	//Желтый				(11111 111111 00000)	(FFFF00)
#define     CYAN			0x07FF	//Голубой				(00000 111111 11111)	(00FFFF)
#define		MAGENTA			0xF81F	//Фиолетовый			(11111 000000 11111)	(FF00FF)
#define		ORANGE			0xFD00	//Оранжевый				(11111 101001 11111)	(FFA500)

#define		GRAY			0xF81F	//Серый					(01111 011111 01111)	(808080)
#define		MAROON			0x7800	//Темно красный			(01111 000000 00000)	(800000)
#define     GREEN			0X03E0	//Темно зеленый			(00000 011111 00000)	(008000)
#define		NAVY			0x000F	//Темно синий			(00000 000000 01111)	(000080)
#define		OLIVE			0x7BE0	//Темно желтый			(01111 011111 00000)	(808000)
#define		TEAL			0x03EF	//Темно голубой			(00000 011111 01111)	(008080)
#define		PURPLE			0x780F	//Темно фиолетовый		(01111 000000 01111)	(800080)

#define		SILVER			0xBDF7	//Светло серый			(10111 101111 10111)	(C0C0C0)
#define		WHITESMOKE		0xE75C	//Белый дым				(11101 111100 11010)	(EEEEEE)

#define		TOMATO			0xFB08	//Томатный				(11111 011000 01000)	(FF6347)
#define		PALEGREEN		0x97D2	//Бледно зеленый		(10010 111110 10010)	(98FB98)
#define		LIGTSCYBLUE		0x865E	//Небесно светло голубой(10000 110010 11110)	(87CEFA)
#define		KHAKI			0xEF11	//Хаки					(11111 011000 01000)	(F0E68C)
#define		PALETURQUOSE	0xAF5C	//Бледно бирюзовый		(10101 111010 11100)	(AFEEEE)
#define		LIGHTPINK		0xFD97	//Светло розовый		(11111 101100 10111)	(FFB6C1)
#define		BEIGE			0xEF9A	//Бежевый				(11100 111010 11100)	(F5F5DC)
//###########################################################################################
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%  Вспомогательные функции  %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
//###########################################################################################
//				Быстрое отображение точки цветом по индексу таблицы KVB.TColor
//###########################################################################################
//Пустая функция создана для совместимости кода с библиотеками не использующими интерфейс FSMC
//	Функция открытия доступа к LCD панели для разрешения циклов быстрого отображения точек
//===========================================================================================
void lcd_Open_Access(void);
//===========================================================================================
//Пустая функция создана для совместимости кода с библиотеками не использующими интерфейс FSMC
//	Функция закрытия доступа к LCD панели для завершения циклов быстрого отображения точек
//===========================================================================================
void lcd_Close_Access(void);
//===========================================================================================
//Размер точки 1x1 пиксель
//===========================================================================================
//Индекс цвета из таблицы TColor
void LCD_Fast_Point(uint16_t x, uint16_t y, uint8_t icolor);
//===========================================================================================
//Размер точки 2x2 пикселя (центр точки верхний левый угол)
//===========================================================================================
//Индекс цвета из таблицы TColor
void LCD_Fast_Point2(uint16_t x, uint16_t y, uint8_t icolor);
//===========================================================================================
//Размер точки 3x3 пикселя (центр точки верхний левый угол)
//===========================================================================================
//Индекс цвета из таблицы TColor
void LCD_Fast_Point3(uint16_t x, uint16_t y, uint8_t icolor);
//###########################################################################################
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
//%%%%%%%%%%%%%%%%%%%%%%%%%  Функции работы драйвера LCD панели  %%%%%%%%%%%%%%%%%%%%%%%%%%%%
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
//###########################################################################################
//Настройка скорости отображения LCD панели для файла main.c в зависимости от подключенной библиотеки
//###########################################################################################
//					КОНФИГУРАЦИЯ ДИСПЛЕЯ (Пользователь выбирает один)
//===========================================================================================
//#define USE_ILI9325
//#define USE_ILI9341
//#define USE_ILI9481
#define USE_ILI9486
//#define USE_OTM8009A
//===========================================================================================
//				АВТОМАТИЧЕСКИЙ ВЫБОР НАСТРОЕК И ТАЙМИНГОВ В ЗАВИСИМОСТИ ОТ LCD
//===========================================================================================
#if defined(USE_ILI9325)
    #define LCD_NAME					"ILI9325"
	#define KVB_AddressSetupTime		1 //Влияние: 10% Небольшое, но необходимое дисплею, чтобы понять, что сейчас прилетит — команда или пиксель.
	#define KVB_AddressHoldTime			1 //Игнорируется в режиме Access Mode A (используется только в режиме Mode D / NOR Flash).
	#define KVB_DataSetupTime			3 //Влияние: 90% (САМОЕ КРИТИЧЕСКОЕ) время считывания пикселя с шины данных.
	#define KVB_BusTurnAroundDuration	1 //Задает паузу между чтением и записью, чтобы избежать конфликта шины. 
	#define KVB_CLKDivision				2 //Используются только для синхронной памяти (когда задействована линия тактирования FSMC_CLK).
	#define KVB_DataLatency				2 //Используются только для синхронной памяти (когда задействована линия тактирования FSMC_CLK).

#elif defined(USE_ILI9341)
	#define LCD_NAME					"ILI9341"
    #define KVB_AddressSetupTime		10 //Влияние: 10% Небольшое, но необходимое дисплею, чтобы понять, что сейчас прилетит — команда или пиксель.
	#define KVB_AddressHoldTime			1 //Игнорируется в режиме Access Mode A (используется только в режиме Mode D / NOR Flash).
	#define KVB_DataSetupTime			4 //Влияние: 90% (САМОЕ КРИТИЧЕСКОЕ) время считывания пикселя с шины данных.
	#define KVB_BusTurnAroundDuration	1 //Задает паузу между чтением и записью, чтобы избежать конфликта шины. 
	#define KVB_CLKDivision				2 //Используются только для синхронной памяти (когда задействована линия тактирования FSMC_CLK).
	#define KVB_DataLatency				2 //Используются только для синхронной памяти (когда задействована линия тактирования FSMC_CLK).

#elif defined(USE_ILI9481)
	#define LCD_NAME					"ILI9481"
	#define KVB_AddressSetupTime		6 //Влияние: 10% Небольшое, но необходимое дисплею, чтобы понять, что сейчас прилетит — команда или пиксель.
	#define KVB_AddressHoldTime			1 //Игнорируется в режиме Access Mode A (используется только в режиме Mode D / NOR Flash).
	#define KVB_DataSetupTime			6 //Влияние: 90% (САМОЕ КРИТИЧЕСКОЕ) время считывания пикселя с шины данных.
	#define KVB_BusTurnAroundDuration	1 //Задает паузу между чтением и записью, чтобы избежать конфликта шины. 
	#define KVB_CLKDivision				2 //Используются только для синхронной памяти (когда задействована линия тактирования FSMC_CLK).
	#define KVB_DataLatency				2 //Используются только для синхронной памяти (когда задействована линия тактирования FSMC_CLK).

#elif defined(USE_ILI9486)
	#define LCD_NAME					"ILI9486"
	#define KVB_AddressSetupTime		6 //Влияние: 10% Небольшое, но необходимое дисплею, чтобы понять, что сейчас прилетит — команда или пиксель.
	#define KVB_AddressHoldTime			1 //Игнорируется в режиме Access Mode A (используется только в режиме Mode D / NOR Flash).
	#define KVB_DataSetupTime			2 //Влияние: 90% (САМОЕ КРИТИЧЕСКОЕ) время считывания пикселя с шины данных.
	#define KVB_BusTurnAroundDuration	1 //Задает паузу между чтением и записью, чтобы избежать конфликта шины. 
	#define KVB_CLKDivision				2 //Используются только для синхронной памяти (когда задействована линия тактирования FSMC_CLK).
	#define KVB_DataLatency				2 //Используются только для синхронной памяти (когда задействована линия тактирования FSMC_CLK).

#elif defined(USE_OTM8009A)
	#define LCD_NAME					"OTM8009A"
	#define KVB_AddressSetupTime		1 //Влияние: 10% Небольшое, но необходимое дисплею, чтобы понять, что сейчас прилетит — команда или пиксель.
	#define KVB_AddressHoldTime			1 //Игнорируется в режиме Access Mode A (используется только в режиме Mode D / NOR Flash).
	#define KVB_DataSetupTime			3 //Влияние: 90% (САМОЕ КРИТИЧЕСКОЕ) время считывания пикселя с шины данных.
	#define KVB_BusTurnAroundDuration	1 //Задает паузу между чтением и записью, чтобы избежать конфликта шины. 
	#define KVB_CLKDivision				2 //Используются только для синхронной памяти (когда задействована линия тактирования FSMC_CLK).
	#define KVB_DataLatency				2 //Используются только для синхронной памяти (когда задействована линия тактирования FSMC_CLK).

#else
    #error "Ошибка: Ни один дисплей не выбран в конфигурационном файле!"
#endif
//###########################################################################################
//							Функция инициализации LCD панели
//###########################################################################################
void lsd_Display_Init(uint8_t orientation);
//###########################################################################################
//					Функция установки вертикальной области прокрутки
//###########################################################################################
void lcd_Init_Ver_Scroll(uint16_t top, uint16_t scroll, uint16_t bottom);
//###########################################################################################
//					Функция сдвига вертикальной области прокрутки
//###########################################################################################
void lcd_Move_Ver_Offset(uint16_t offset);
//###########################################################################################
//				Функция отключения дисплея (Вход в режим энергосбережения)
//###########################################################################################
void lcd_Display_Off(void);
//###########################################################################################
//					Функция включения дисплея (Выход из режима сна)
//###########################################################################################
void lcd_Display_On(void);
//###########################################################################################
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
//%%%%%%%%%%%%%%%%%%%%%%%  Основные функции работы с LCD панелью  %%%%%%%%%%%%%%%%%%%%%%%%%%%
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
//###########################################################################################
//			Функция установки цветов в таблицу TColor из формата RGB по индексу
//###########################################################################################
void lcd_Set_TColor_RGB(uint8_t r, uint8_t g, uint8_t b, uint8_t icolor);
//###########################################################################################
//			Функция установки цветов в таблицу TColor из формата RGB565 по индексу
//###########################################################################################
void lcd_Set_TColor_RGB565(uint16_t color, uint8_t icolor);
//###########################################################################################
//	Функция установки градиента цвета в таблицу TGradColor из формата RGB по индексу 
//###########################################################################################
void lcd_Set_TGradColor_RGB(uint8_t blondR, uint8_t blondG, uint8_t blondB,		//Первый (светлый) цвет
									uint8_t darkR, uint8_t darkG, uint8_t darkB,//Второй (темный) цвет
									uint8_t index);	//Индекс цветов
//###########################################################################################
//	Функция установки градиента цвета в таблицу TGradColor из формата RGB565 по индексу  в неполный формат R=5, G=6, B=5
//###########################################################################################
void lcd_Set_TGradColor_RGB565(uint16_t blond, uint16_t dark, uint8_t index);
//###########################################################################################
//			Функция заливки экрана LCD панели одним цветом по индексу таблицы TColor
//###########################################################################################
void Lcd_Fill_Screen(uint8_t icolor);
//###########################################################################################
//				Функция отображения закрашенного прямоугольника цветом по индексу
//###########################################################################################
//Координаты x и y считаются от 0 (0-479) и (0-319) а ширина и высота от 1 (1-480) и (1-320), индекс цвета из таблицы TColor
uint8_t Lcd_FillRect(uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint8_t icolor);
//###########################################################################################
//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash в горизонтально или вертикальном направлении и в линейном или центральном представлении
//###########################################################################################
void Lcd_Grad_Fill_Screen(uint8_t memory,	//0 - цвет выбирается из оперативной памяти TGradColor, 1 - цвет выбирается из flash памяти TGradColorFlash
							uint8_t icolor,	//Индекс цвета из таблицы TGradColor или TGradColorFlash
											//0 = Серый, 1 = Жёлто красный (красно жёлтый), 2 = Жёлто синий (сине жёлтый), 3 = Зелёно красный (красно зелёный), 4 = Зелёно синий (сине зеленый),5 = Зелёно голубой (голубого зелёный)
											//6 = Красно синий (сине красный), 7 = Фиолетово сине голубой (голубого сине фиолетовый), 8 = Жёлто зелено голубой (голубого зелёно жёлтый), 9 = Фиолетово красно жёлтый (жёлто красно фиолетовый), 10 = Жёлто зеленый (зелёно жёлтый)
							uint8_t render,	//Формат визуализации 0 = вертикальный, 1 = горизонтальный
							uint8_t surface);//Формат отображения поверхности: 0 = линейный градиент от 2 к 1 цвету, 1 = линейный градиент от 1 к 2 цвету, 2 = центральный градиент от 2 к 1 и обратно к 2, 3 = центральный градиент от 1 к 2 и обратно к 1)
//###########################################################################################
//Функция отображения закрашенного прямоугольника градиентным цветом из таблицы TGradColor или TGradColorFlash
//###########################################################################################
//Координаты x и y считаются от 0 (0-479) и (0-319) а ширина и высота от 1 (1-480) и (1-320), индекс цвета из таблицы TGradColor
void Lcd_Grad_FillRect(uint8_t memory,//0 - цвет выбирается из оперативной памяти TGradColor, 1 - цвет выбирается из flash памяти TGradColorFlash
						uint16_t x, uint16_t y, uint16_t width, uint16_t height,
						uint8_t icolor,	//Индекс цвета из таблицы TGradColor или TGradColorFlash
										//0 = Серый, 1 = Жёлто красный (красно жёлтый), 2 = Жёлто синий (сине жёлтый), 3 = Зелёно красный (красно зелёный), 4 = Зелёно синий (сине зеленый),5 = Зелёно голубой (голубого зелёный)
										//6 = Красно синий (сине красный), 7 = Фиолетово сине голубой (голубого сине фиолетовый), 8 = Жёлто зелено голубой (голубого зелёно жёлтый), 9 = Фиолетово красно жёлтый (жёлто красно фиолетовый), 10 = Жёлто зеленый (зелёно жёлтый)
						uint8_t render,	//Формат визуализации 0 = вертикальный, 1 = горизонтальный
						uint8_t surface);//Формат отображения поверхности: 0 = линейный градиент от 2 к 1 цвету, 1 = линейный градиент от 1 к 2 цвету, 2 = центральный градиент от 2 к 1 и обратно к 2, 3 = центральный градиент от 1 к 2 и обратно к 1)
//###########################################################################################
//Функция заливки экрана LCD панели одним цветом по индексу таблицы TColor при помощи вертикального сдвига LCD
//###########################################################################################
void Lcd_Fill_Screen_Ver_Scroll(uint8_t Direction,	//Направление сдвига 0 = влево, вверх ; 1 = вправо, вниз
								uint8_t icolor);	//Индекс цвета из таблицы TColor
//###########################################################################################
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%  Функции с построением линий  %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
//###########################################################################################
//###########################################################################################
//				Функции отображения линии толщиной в одну точку (1x1)
//###########################################################################################
//Координаты x и y считаются от 0 (0-479) и (0-319) а индекс цвета из таблицы TColor
void Lcd_Line1(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint8_t ficolor);
//					Функции отображения линии толщиной в две точки (2x2)
//###########################################################################################
//Координаты x и y считаются от 0 (0-478) и (0-318) а индекс цвета из таблицы TColor, центр точки верхний левый угол
void Lcd_Line2(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint8_t ficolor);
//###########################################################################################
//					Функции отображения линии толщиной в три точки (3x3)
//###########################################################################################
//Координаты x и y считаются от 0 (0-477) и (0-317) а индекс цвета из таблицы TColor, центр точки верхний левый угол
void Lcd_Line3(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint8_t ficolor);
//###########################################################################################
//			Функция отображения треугольника толщиной в одну или две или три точки
//###########################################################################################
//Координаты x и y считаются от 0 (0-479) и (0-319) а индекс цвета из таблицы TColor
//size Если 0 = (1x1 пиксель), 1 = (2x2 пикселя центр точки верхний левый угол), 2 = (3x3 пикселя центр точки верхний левый угол)
void Lcd_LineTriangle(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, uint8_t ficolor, uint8_t size);
//###########################################################################################
//	Функция отображения равностороннего треугольника толщиной в одну или две или три точки
//###########################################################################################
//Координаты x и y считаются от 0 (0-479) и (0-319) а индекс цвета из таблицы TColor
//size Если 0 = (1x1 пиксель), 1 = (2x2 пикселя центр точки верхний левый угол), 2 = (3x3 пикселя центр точки верхний левый угол)
//orientation - Ориентация вершины, если 0 = вверх, 1 = вниз, 2 = вправо, 3 = влево
void Lcd_LineEquilateralTriangle(int16_t x0, int16_t y0, int16_t radius, uint8_t orientation, uint16_t ficolor, uint8_t size);
//###########################################################################################
//	Функция отображения равнобедренного треугольника толщиной в одну или две или три точки
//###########################################################################################
//Координаты x и y считаются от 0 (0-479) и (0-319) а индекс цвета из таблицы TColor
//size Если 0 = (1x1 пиксель), 1 = (2x2 пикселя центр точки верхний левый угол), 2 = (3x3 пикселя центр точки верхний левый угол)
//orientation - Ориентация вершины, если 0 = вверх, 1 = вниз, 2 = вправо, 3 = влево
void Lcd_LineIsoscelesTriangle(int16_t x0, int16_t y0, int16_t width, int16_t height, uint8_t orientation, uint8_t ficolor, uint8_t size);
//###########################################################################################
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%  Функции печати  %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
//###########################################################################################
//			Функция установки количества символов в горизонтальной табуляции
//###########################################################################################
void lcd_Set_Nsymtab_Font(uint8_t nsymtab);
//###########################################################################################
//						Функция установки отображаемого шрифта
//###########################################################################################
void lcd_Set_Font(const uint8_t Font[]);
//###########################################################################################
//	Функция установки двух цветов шрифта (градиента или первого и второго) в формате RGB
//###########################################################################################
void lcd_Set_Color_Font_RGB(uint8_t r0, uint8_t g0, uint8_t b0, uint8_t r1, uint8_t g1, uint8_t b1,
									 uint8_t icolor); //Если: 0 = цвета символа, 1 = цвета подложки, 2 цвета окантовки (тени)
//###########################################################################################
//	Функция установки двух цветов шрифта (градиента или первого и второго) в формате RGB565
//###########################################################################################
void lcd_Set_Color_Font_RGB565(uint16_t color0, uint16_t color1,
									 uint8_t icolor); //Если: 0 = цвета символа, 1 = цвета подложки, 2 цвета окантовки (тени)
//###########################################################################################
//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
//###########################################################################################
void lcd_Set_Edging_Font(uint8_t edging);
//###########################################################################################
//	Функция установки прозрачности или подложки шрифта: 0 - не прозрачная подложка, 1 - прозрачная подложка
//###########################################################################################
void lcd_Set_Transparent_Font(uint8_t transparent);
//###########################################################################################
//Функция выравнивания строки текста
//0 : Выравнивание по левому краю
//1 : Выравнивание по центру
//2 : Выравнивание по правому краю
//###########################################################################################
void lcd_Set_Aligning_Font(uint8_t aligning);
//###########################################################################################
//Функция установки кернинга шрифта (расстояние между буквами) с коррекцией длины табуляции
//###########################################################################################
void lcd_Set_Kerning_Font(uint8_t kerning);
//###########################################################################################
//					Функция установки расстояния между строками
//###########################################################################################
void lcd_Set_Spacing_Font(int8_t spacing);	
//###########################################################################################
//		Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения
//###########################################################################################
void lcd_Set_Scale_Font(uint8_t scale);
//###########################################################################################
//		Функция вывода на дисплей целого числа или содержимое целочисленной переменной
//###########################################################################################
void Lcd_Text_NumberI(uint8_t render,	//Формат визуализации 0 = вертикальный, 1 = горизонтальный
						uint8_t fcolor,	//Формат цветового отображения символов (слева или сверху):
										//0 = нет отображения символов, отображается только окантовка
										//1-2 = сплошной цвет, 1 = первый, 2 второй
										//3-4 = линейный градиент, 3 = первый > второй, 4 = второй > первый
										//5-6 = центральный градиент, 5 = первый > второй > первый, 6 = второй > первый > второй
						int32_t number,	//целое число или целочисленная переменная
					uint16_t xstring,	//Позиция по горизонтали, если 0 то позиция прежняя
					uint16_t ybaseline,	//Позиция базовой линии шрифта по вертикали, если 0 то позиция прежняя
					uint16_t lstring,	//Длина строки по горизонтали, если 0 то длина прежняя
						uint8_t length,	//Длина строки отображаемого числа, если число вместе с знаком меньше длинны, то будет дополнено символом переданным symbol
						uint8_t symbol);//Символ дополнения строки до заданной длины
//###########################################################################################
//Функция вывода на дисплей вещественного числа или содержимое переменной вещественного типа
//###########################################################################################
void Lcd_Text_NumberF(uint8_t render,	//Формат визуализации 0 = вертикальный, 1 = горизонтальный
						uint8_t fcolor,	//Формат цветового отображения символов (слева или сверху):
										//0 = нет отображения символов, отображается только окантовка
										//1-2 = сплошной цвет, 1 = первый, 2 второй
										//3-4 = линейный градиент, 3 = первый > второй, 4 = второй > первый
										//5-6 = центральный градиент, 5 = первый > второй > первый, 6 = второй > первый > второй
						double number,	//Вещественное число или содержимое переменной вещественного типа
					uint16_t xstring,	//Позиция по горизонтали, если 0 то позиция прежняя
					uint16_t ybaseline,	//Позиция базовой линии шрифта по вертикали, если 0 то позиция прежняя
					uint16_t lstring,	//Длина строки по горизонтали, если 0 то длина прежняя
						uint8_t dec,	//Количество знаков после десятичной точки может быть задано от 1 до 5
						uint8_t divider,//Символ, выполняющий роль десятичной точки (по умолчанию '.' или любой ',')
						uint8_t length,	//Длина строки отображаемого числа, если число вместе с знаком меньше длинны, то будет дополнено символом переданным symbol
						uint8_t symbol);//Символ дополнения строки до заданной длины, не должен быть пробелом
//###########################################################################################
//	Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием,
//	если выравнивание = 0 (левый край) то работает табуляция и до писание текста другим шрифтом
//	или цветом. Есть возможность указать коэффициент увеличения шрифта и прозрачность подложки.
//	Обработка строк из оперативной и программной памяти.
//###########################################################################################
void Lcd_Text_Format(uint8_t render,	//Формат визуализации 0 = вертикальный, 1 = горизонтальный
						uint8_t fcolor,	//Формат цветового отображения символов (слева или сверху):
										//0 = нет отображения символов, отображается только окантовка
										//1-2 = сплошной цвет, 1 = первый, 2 второй
										//3-4 = линейный градиент, 3 = первый > второй, 4 = второй > первый
										//5-6 = центральный градиент, 5 = первый > второй > первый, 6 = второй > первый > второй
					const char *str,	//Отображаемая строка
						uint8_t memory,	//0 = строка из оперативной памяти, 1 = строка из программной памяти
					uint16_t xstring,	//Позиция по горизонтали, если 0 то позиция прежняя
					uint16_t ybaseline,	//Позиция базовой линии шрифта по вертикали, если 0 то позиция прежняя
					uint16_t lstring);	//Длина строки по горизонтали, если 0 то длина прежняя
//###########################################################################################
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
//%%%%%%%%%%%%%%  Функции многофункционального трех поверхностного объекта  %%%%%%%%%%%%%%%%%
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
//###########################################################################################
//	Функция установки градиента цвета в таблицу GradColorRound из формата RGB по индексу
//###########################################################################################
void lcd_Set_GradColorRound_RGB(uint8_t blondR, uint8_t blondG, uint8_t blondB,	//Первый светлый цвет
									uint8_t darkR, uint8_t darkG, uint8_t darkB,//Второй темный цвет
									uint8_t index);	//Индекс цветов: 0 = наружная поверхность, 1 = разделяющая поверхность, 2 = внутренняя поверхность
//###########################################################################################
//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
//###########################################################################################
void lcd_Set_Grad_Color_MultiRoundPrintFlash(uint8_t icolor);//Нормальный цвет: 1 = Серый, 2 = Красный, 3 = Зеленый, 4 = Синий, 5 = Желтый, 6 = Голубой, 7 = Фиолетовый;
															//Яркий цвет: 8 = Серый, 9 = Красный, 10 = Зеленый, 11 = Синий, 12 = Желтый, 13 = Голубой, 14 = Фиолетовый;
//###########################################################################################
//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
//###########################################################################################
void Lcd_Multi_three_Round(uint8_t render,	//Формат визуализации 0 = вертикальный, 1 = горизонтальный
						uint8_t icolor,		//Индекс цвета объекта из программной памяти начиная с 1, если 0 то из оперативной памяти таблицы KVBROUND.GradColorRound с индексами 0,1,2 с установкой через функцию lcd_Set_GradColorRound_RGB
											//Нормальный цвет: 1 = Серый, 2 = Красный, 3 = Зеленый, 4 = Синий, 5 = Желтый, 6 = Голубой, 7 = Фиолетовый;
											//Яркий цвет: 8 = Серый, 9 = Красный, 10 = Зеленый, 11 = Синий, 12 = Желтый, 13 = Голубой, 14 = Фиолетовый;
						//---------------------------------------------------------------------------
						uint16_t x,			//Верхняя левая точка начала объекта по оси X (горизонтали)
						uint16_t y,			//Верхняя левая точка начала объекта по оси Y (вертикали)
						uint16_t width,		//Ширина объекта
						uint16_t height,	//Высота объекта
						//---------------------------------------------------------------------------
						uint8_t radius,		//Наружный радиус окружности
						uint8_t surface0,	//Формат отображения внешней поверхности: 0 = не отображать, 1 = светлый цвет, 2 = темный цвет, 3 = линейный градиент от темного к светлому, 4 = линейный градиент от светлого к темному, 5 = центральный градиент от темного к светлому и обратно к темному, 6 = центральный градиент от светлого к темному и обратно к светлому
						//---------------------------------------------------------------------------
						uint8_t border1,	//Окантовка - бордюр от наружного радиуса внутрь, если 0 то не отображается
						uint8_t surface1,	//Формат отображения внутренней поверхности: 0 = не отображать, 1 = светлый цвет, 2 = темный цвет, 3 = линейный градиент от темного к светлому, 4 = линейный градиент от светлого к темному, 5 = центральный градиент от темного к светлому и обратно к темному, 6 = центральный градиент от светлого к темному и обратно к светлому
						int8_t xoffset1,	//Смещение внутренней поверхности по оси X
						int8_t yoffset1,	//Смещение внутренней поверхности по оси Y
						//---------------------------------------------------------------------------
						uint8_t border2,	//Окантовка - бордюр от наружного радиуса внутрь, если 0 то не отображается толщина
						uint8_t surface2,	//Формат отображения внутренней поверхности: 0 = не отображать, 1 = светлый цвет, 2 = темный цвет, 3 = линейный градиент от темного к светлому, 4 = линейный градиент от светлого к темному, 5 = центральный градиент от темного к светлому и обратно к темному, 6 = центральный градиент от светлого к темному и обратно к светлому
						int8_t xoffset2,	//Смещение внутренней поверхности по оси X
						int8_t yoffset2);	//Смещение внутренней поверхности по оси Y
//###########################################################################################
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
//%%%%%%%%%%%%%%%%%%%%%  Функции отображения графических примитивов  %%%%%%%%%%%%%%%%%%%%%%%%
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
//###########################################################################################
//			Функция отображения прямоугольника c окантовкой и заливкой внутри
//###########################################################################################
//Координаты x и y считаются от 0 (0-479) и (0-319) а ширина и высота от 1 (1-480) и (1-320), индексы цвета из таблицы TColor
//Ширина и высота прямоугольника не может быть меньше 3 пикселей
uint8_t Lcd_BorderRect(uint8_t surface, //Отображается если 0 - весь прямоугольник, 1 - только бордюр, 2 - только центральная заливка
					uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint16_t border, uint8_t ficolor, uint8_t bicolor);
//###########################################################################################
//						Функция отображения закрашенной окружности
//###########################################################################################
//Координаты x и y считаются от 0 (0-479) и (0-319) а радиус от 1 (1-160), индекс цвета из таблицы TColor
//Радиус окружности не может быть меньше 2 пикселей
uint8_t Lcd_FillCircle(uint16_t x, uint16_t y, uint16_t radius, uint8_t ficolor);
//###########################################################################################
//			Функция отображения окружности толщиной в одну точку и заливкой внутри
//###########################################################################################
//Координаты x и y считаются от 0 (0-479) и (0-319) а радиус от 1 (1-160), индексы цвета из таблицы TColor
//Радиус окружности не может быть меньше 2 пикселей
uint8_t Lcd_Circle(uint8_t surface, //Отображается если 0 - вся окружность, 1 - только бордюр, 2 - только центральная заливка
				uint16_t x, uint16_t y, uint8_t radius, uint8_t ficolor, uint8_t bicolor);
//###########################################################################################
//				Функция отображения окружности c окантовкой и заливкой внутри
//###########################################################################################
//Координаты x и y считаются от 0 (0-479) и (0-319) а радиус от 1 (1-160), индексы цвета из таблицы TColor
//Радиус окружности не может быть меньше 4 пикселей
uint8_t Lcd_BorderCircle(uint8_t surface, //Отображается если 0 - вся окружность, 1 - только бордюр, 2 - только центральная заливка
						uint16_t x, uint16_t y, uint16_t radius, uint16_t border, uint8_t ficolor, uint8_t bicolor);
//###########################################################################################
//				Функция отображения округлого закрашенного прямоугольника
//###########################################################################################
//Координаты x и y считаются от 0 (0-479) и (0-319) а ширина и высота от 1 (1-480) и (1-320), индекс цвета из таблицы TColor
//Ширина и высота прямоугольника не может быть меньше 5 пикселей
uint8_t Lcd_FillRoundRect(uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint16_t radius, uint8_t ficolor);
//###########################################################################################
//Функция отображения округлого прямоугольника c окантовкой толщиной в одну точку и заливкой внутри
//###########################################################################################
//Координаты x и y считаются от 0 (0-479) и (0-319) а ширина и высота от 1 (1-480) и (1-320), индексы цвета из таблицы TColor
//Ширина и высота прямоугольника не может быть меньше 5 пикселей
uint8_t Lcd_RoundRect(uint8_t surface, //Отображается если 0 - весь прямоугольник, 1 - только бордюр, 2 - только центральная заливка
					uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint16_t radius, uint8_t ficolor, uint8_t bicolor);
//###########################################################################################
//		Функция отображения округлого прямоугольника c окантовкой и заливкой внутри
//###########################################################################################
//Координаты x и y считаются от 0 (0-479) и (0-319) а ширина и высота от 1 (1-480) и (1-320), индексы цвета из таблицы TColor
//Ширина и высота прямоугольника не может быть меньше 7 пикселей
uint8_t Lcd_BorderRoundRect(uint8_t surface, //Отображается если 0 - весь прямоугольник, 1 - только бордюр, 2 - только центральная заливка
						uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint16_t radius, uint16_t border, uint8_t ficolor, uint8_t bicolor);
//###########################################################################################
//						Функция отображения закрашенного треугольника
//###########################################################################################
//Координаты x и y считаются от 0 (0-479) и (0-319) а индекс цвета из таблицы TColor
void Lcd_FillTriangle(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, uint8_t ficolor);
//###########################################################################################
//				Функция отображения закрашенного равностороннего треугольника
//###########################################################################################
//Координаты x и y считаются от 0 (0-479) и (0-319) а радиусы от 1 (1-160), индексы цвета из таблицы TColor
//Радиус прямоугольника не может быть меньше 5 пикселей
//orientation - Ориентация вершины, если 0 = вверх, 1 = вниз, 2 = вправо, 3 = влево
uint8_t Lcd_FillEquilateralTriangle(int16_t x0, int16_t y0, int16_t radius, uint8_t orientation, uint8_t ficolor);
//###########################################################################################
//	Функция отображения равностороннего треугольника  c окантовкой и заливкой внутри
//###########################################################################################
//Координаты x и y считаются от 0 (0-479) и (0-319) а радиусы от 1 (1-160), индексы цвета из таблицы TColor
//Радиус прямоугольника не может быть меньше 3 пикселей
//orientation - Ориентация вершины, если 0 = вверх, 1 = вниз, 2 = вправо, 3 = влево
uint8_t Lcd_BorderEquilateralTriangle(uint8_t surface, int16_t x0, int16_t y0, int16_t radius, uint8_t border, uint8_t orientation, uint8_t ficolor, uint8_t bicolor);
//###########################################################################################
//				Функция отображения закрашенного равнобедренного треугольника
//###########################################################################################
//Координаты x и y считаются от 0 (0-479) и (0-319) а радиусы от 1 (1-160), индексы цвета из таблицы TColor
//Ширина и высота прямоугольника не может быть меньше 4 ???
//orientation - Ориентация вершины, если 0 = вверх, 1 = вниз, 2 = вправо, 3 = влево
int8_t Lcd_FillIsoscelesTriangle(int16_t x0, int16_t y0, int16_t width, int16_t height, uint8_t orientation, uint8_t ficolor);
//###########################################################################################
//						Функция отображения закрашенного эллипса
//###########################################################################################
//Координаты x и y считаются от 0 (0-479) и (0-319) а радиусы от 1 (1-160), индексы цвета из таблицы TColor
//Радиусы эллипса не могут быть меньше 2 пикселей
uint8_t Lcd_FillEllipse(uint16_t x, uint16_t y, uint16_t xradius, uint16_t yradius, uint8_t ficolor);
//###########################################################################################
//			Функция отображения эллипса толщиной в одну точку и заливкой внутри
//###########################################################################################
//Координаты x и y считаются от 0 (0-479) и (0-319) а радиусы от 1 (1-160), индексы цвета из таблицы TColor
//Радиусы эллипса не могут быть меньше 2 пикселей
uint8_t Lcd_Ellipse(uint8_t surface, //Отображается если 0 - весь эллипс, 1 - только бордюр, 2 - только центральная заливка
				uint16_t x, uint16_t y, uint16_t xradius, uint16_t yradius, uint8_t ficolor, uint8_t bicolor);
//###########################################################################################
//				Функция отображения эллипса c окантовкой и заливкой внутри
//###########################################################################################
//Координаты x и y считаются от 0 (0-479) и (0-319) а радиусы от 1 (1-160), индексы цвета из таблицы TColor
//Радиусы эллипса не могут быть меньше 3 пикселей, а бордюр меньше 1 пикселя
uint8_t Lcd_BorderEllipse(uint8_t surface, //Отображается если 0 - весь эллипс, 1 - только бордюр, 2 - только центральная заливка
						uint16_t x, uint16_t y, uint16_t xradius, uint16_t yradius, uint16_t border, uint8_t ficolor, uint8_t bicolor);
//###########################################################################################
//		Функция отображения округлого закрашенного прямоугольника на основе эллипса
//###########################################################################################
//Координаты x и y считаются от 0 (0-479) и (0-319) а ширина и высота от 1 (1-480) и (1-320), индексы цвета из таблицы TColor
//Ширина и высота прямоугольника не могут быть меньше 4 пикселей, а радиусы меньше 2 пикселей
uint8_t Lcd_FillEllipseRect(uint16_t x, uint16_t y, uint16_t width, uint16_t height,  uint16_t xradius, uint16_t yradius, uint8_t ficolor);
//###########################################################################################
//Функция отображения округлого прямоугольника на основе эллипса толщиной в одну точку и заливкой внутри
//###########################################################################################
//Координаты x и y считаются от 0 (0-479) и (0-319) а ширина и высота от 1 (1-480) и (1-320), индексы цвета из таблицы TColor
//Ширина и высота прямоугольника не могут быть меньше 4 пикселей, а радиусы меньше 2 пикселей
uint8_t Lcd_EllipseRect(uint8_t surface, //Отображается если 0 - весь прямоугольник, 1 - только бордюр, 2 - только центральная заливка
					uint16_t x, uint16_t y, uint16_t width, uint16_t height,  uint16_t xradius, uint16_t yradius, uint8_t ficolor, uint8_t bicolor);
//###########################################################################################
//Функция отображения округлого прямоугольника на основе эллипса c окантовкой и заливкой внутри
//###########################################################################################
//Координаты x и y считаются от 0 (0-479) и (0-319) а ширина и высота от 1 (1-480) и (1-320), индексы цвета из таблицы TColor
//Ширина и высота прямоугольника не могут быть меньше 8 пикселей, а радиусы меньше 4 пикселей и бордюр меньше 2 пикселей
uint8_t Lcd_BorderEllipseRect(uint8_t surface, //Отображается если 0 - весь прямоугольник, 1 - только бордюр, 2 - только центральная заливка
							uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint16_t xradius, uint16_t yradius, uint16_t border, uint8_t ficolor, uint8_t bicolor);
//###########################################################################################
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%  Имена подключаемых шрифтов  %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
//######################################################################################################
// Шрифты - только цифры и разделитель 0123456789: использовать обязательно с кернингом = 11 символов
//######################################################################################################
extern const kvbu8_t KVB_13x38x4[];
//extern const kvbu8_t KVB_24x27x11_seven_segment_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//======================================================================================================
//extern const kvbu8_t KVB_4x9x11_sans_normal_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_5x8x11_ter_normal_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_5x9x11_sans_bold_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_6x10x11_ter_normal_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_7x10x11_serif_bold_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_7x10x11_ter_bold_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_7x12x11_ter_normal_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_7x13x11_ter_normal_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x12x11_serif_bold_kepning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x12x11_ter_bold_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x13x11_serif_bold_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x13x11_ter_bold_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x14x11_ter_normal_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_9x13x11_dot_matrix_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_9x13x11_line_matrix_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_9x14x11_ter_bold_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_9x15x11_ter_normal_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x15x11_ter_bold_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_11x18x11_ter_bold_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_11x18x11_ter_normal_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_13x20x11_ter_bold_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_12x20x11_ter_normal_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_14x20x11_dot_matrix_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_14x20x11_line_matrix_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_19x27x11_dot_matrix_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_19x27x11_line_matrix_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_19x27x11_seven_segment_kerning[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//######################################################################################################
//								Шрифты - русско английские = 162 символа
//######################################################################################################
//extern const kvbu8_t KVB_5x12_ER_sans_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_6x12_ER_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_7x12_ER_sans_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x14_ER_serif_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x14_ER_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x14_ER_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x16_ER_serif_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x16_ER_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
extern const kvbu8_t KVB_8x16_ER_ter_normal[];
//extern const kvbu8_t KVB_10x18_ER_serif_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
extern const kvbu8_t KVB_10x18_ER_ter_bold[];
//extern const kvbu8_t KVB_10x18_ER_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x20_ER_serif_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
extern const kvbu8_t KVB_10x20_ER_ter_bold[];
//extern const kvbu8_t KVB_10x20_ER_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_11x22_ER_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_11x22_ER_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
extern const kvbu8_t KVB_12x24_ER_ter_bold[];
//extern const kvbu8_t KVB_12x24_ER_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
extern const kvbu8_t KVB_14x28_ER_ter_bold[];
//extern const kvbu8_t KVB_14x28_ER_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_16x32_ER_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_16x32_ER_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//######################################################################################################
//									Шрифты - английские = 95 символов
//######################################################################################################
//extern const kvbu8_t KVB_5x12_En_sans_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_6x12_En_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_7x12_En_sans_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x14_En_serif_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x14_En_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x14_En_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x16_En_serif_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x16_En_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x16_En_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x18_En_serif_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x18_En_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x18_En_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x20_En_serif_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x20_En_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x20_En_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_11x22_En_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_11x22_En_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_12x24_En_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_12x24_En_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_14x28_En_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_14x28_En_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_16x32_En_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_16x32_En_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//######################################################################################################
//										Шрифты - Цифры = 33 символа
//######################################################################################################
//extern const kvbu8_t KVB_5x12_Nu_sans_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_6x12_Nu_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_7x12_Nu_sans_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x14_Nu_serif_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x14_Nu_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x14_Nu_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x16_Nu_serif_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x16_Nu_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x16_Nu_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x18_Nu_serif_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x18_Nu_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x18_Nu_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x20_Nu_serif_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x20_Nu_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x20_Nu_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_11x22_Nu_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_11x22_Nu_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_12x24_Nu_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_12x24_Nu_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
extern const kvbu8_t KVB_14x28_Nu_ter_bold[];
//extern const kvbu8_t KVB_14x28_Nu_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
extern const kvbu8_t KVB_16x32_Nu_ter_bold[];
//extern const kvbu8_t KVB_16x32_Nu_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//######################################################################################################
//						Шрифты - Русский заглавные и строчные (№ пробел) = 67 символов
//######################################################################################################
//extern const kvbu8_t KVB_5x12_Rf_sans_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_6x12_Rf_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_7x12_Rf_sans_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x14_Rf_serif_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x14_Rf_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x14_Rf_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x16_Rf_serif_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x16_Rf_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x16_Rf_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x18_Rf_serif_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x18_Rf_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x18_Rf_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x20_Rf_serif_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x20_Rf_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x20_Rf_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_11x22_Rf_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_11x22_Rf_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_12x24_Rf_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_12x24_Rf_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_14x28_Rf_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_14x28_Rf_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_16x32_Rf_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_16x32_Rf_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//######################################################################################################
//						Шрифты - Русский строчные (№ пробел) = 35 символов
//######################################################################################################
//extern const kvbu8_t KVB_5x12_Rs_sans_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_6x12_Rs_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_7x12_Rs_sans_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x14_Rs_serif_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x14_Rs_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x14_Rs_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x16_Rs_serif_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x16_Rs_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x16_Rs_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x18_Rs_serif_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x18_Rs_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x18_Rs_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x20_Rs_serif_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x20_Rs_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x20_Rs_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_11x22_Rs_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_11x22_Rs_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_12x24_Rs_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_12x24_Rs_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_14x28_Rs_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_14x28_Rs_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_16x32_Rs_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_16x32_Rs_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//######################################################################################################
//				Шрифты - Русский заглавные (№ пробел) выбираются как строчные = 35 символов
//######################################################################################################
//extern const kvbu8_t KVB_5x12_Rz_sans_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_6x12_Rz_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_7x12_Rz_sans_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x14_Rz_serif_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x14_Rz_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x14_Rz_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x16_Rz_serif_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x16_Rz_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_8x16_Rz_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x18_Rz_serif_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x18_Rz_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x18_Rz_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x20_Rz_serif_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x20_Rz_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_10x20_Rz_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_11x22_Rz_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_11x22_Rz_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_12x24_Rz_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_12x24_Rz_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_14x28_Rz_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_14x28_Rz_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_16x32_Rz_ter_bold[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//extern const kvbu8_t KVB_16x32_Rz_ter_normal[];//Закрыт в демонстрационной версии, полный набор и редактор доступны по запросу
//######################################################################################################
#ifdef __cplusplus
}
#endif

#endif /* __KVB_LCD_H */


