/**
  * @file    KVB_TEST.c
  * @author  Boruzdov Konstantin
  * @version V1.0
  * @date    17-05-2026
  * @brief Cross-platform graphics library for ATmega128 and STM32F407
  * 
  * Copyright (C) 2026 [Boruzdov Konstantin / KVB]. All rights reserved.
  * 
  * Licensed under the Creative Commons Attribution-NonCommercial 4.0 
  * International License (CC BY-NC 4.0).
  * 
  * YOU MAY NOT USE THIS FILE FOR COMMERCIAL PURPOSES. КОММЕРЧЕСКОЕ ИСПОЛЬЗОВАНИЕ ЗАПРЕЩЕНО.
  * For commercial licensing licensing inquiries, please contact: email kboruzdov@mail.ru tel +7 965-363-45-29
  * 
  * Полный текст лицензии: https://creativecommons.org
  */
//###########################################################################################
//									Подключаемые файлы
//###########################################################################################
#include "KVB_TEST.h"
//###########################################################################################
//			Функция тестирования LCD панели с разрешением 480x320 горизонтальная
//###########################################################################################
void lcd_Test480x320Landscape(void)
{
//===========================================================================================
//					Установка восьми простых цветов заливки экрана
//===========================================================================================
	lcd_Set_TColor_RGB(0, 0, 0, 0);//Черный
	lcd_Set_TColor_RGB(255, 255, 255, 1);//Белый
	lcd_Set_TColor_RGB(255, 0, 0, 2);//Красный
	lcd_Set_TColor_RGB(0, 255, 0, 3);//Зелёный
	lcd_Set_TColor_RGB(0, 0, 255, 4);//Синий
	lcd_Set_TColor_RGB(255, 255, 0, 5);//Жёлтый
	lcd_Set_TColor_RGB(0, 255, 255, 6);//Голубой
	lcd_Set_TColor_RGB(255, 0, 255, 7);//Фиолетовый
	/*
	lcd_Set_TColor_RGB565(BLACK, 0);//Черный
	lcd_Set_TColor_RGB565(WHITE, 1);//Белый
	lcd_Set_TColor_RGB565(RED, 2);//Красный
	lcd_Set_TColor_RGB565(LIME, 3);//Зелёный
	lcd_Set_TColor_RGB565(BLUE, 4);//Синий
	lcd_Set_TColor_RGB565(YELLOW, 5);//Жёлтый
	lcd_Set_TColor_RGB565(CYAN, 6);//Голубой
	lcd_Set_TColor_RGB565(MAGENTA, 7);//Фиолетовый
	*/
//===========================================================================================
//							Демонстрируем логотип и автора
//===========================================================================================
	//goto test01;
	Lcd_Fill_Screen(0);//Функция заливки экрана LCD панели одним цветом по индексу таблицы TColorHL
	KVB_Delay(1000);
	lcd_Set_Font(KVB_13x38x4);//Функция установки отображаемого шрифта
	lcd_Set_Nsymtab_Font(4);//Функция установки количества символов в горизонтальной табуляции
	lcd_Set_Transparent_Font(1);//Функция установки подложки шрифта: 0 - не прозрачная подложка, 1 - прозрачная подложка
	lcd_Set_Spacing_Font(0);//Функция установки расстояния между строками
	lcd_Set_Aligning_Font(1);//Функция выравнивания строки текста 0 : Выравнивание по левому краю, 1 : Выравнивание по центру, 2 : Выравнивание по правому краю
	lcd_Set_Scale_Font(2);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения
	lcd_Set_Edging_Font(0);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	lcd_Set_Kerning_Font(0);//Функция установки кернинга шрифта (меж символьное расстояние) с коррекцией длины табуляции
	Lcd_Multi_three_Round(0, 1, 119, 10, 240, 120, 30, 5, 4, 6, 0, 0, 4, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Color_Font_RGB(0, 252, 252, 0, 160, 160, 0);//Цвет символов
	lcd_Set_Color_Font_RGB(80, 80, 80, 80, 80, 80, 2);//Цвет окантовки (тени)
	Lcd_Text_Format(0, 6, str_KVB_en, 1, 149, 108, 180);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	KVB_Delay(1000);
	
	Lcd_Multi_three_Round(0, 12, 119, 10, 240, 120, 30, 5, 4, 0, 0, 0, 4, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(12);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	lcd_Set_Color_Font_RGB(255, 255, 0, 228, 228, 0, 0);//Цвета символов
	lcd_Set_Color_Font_RGB(60, 60, 60, 60, 60, 60, 2);//Цвета окантовки (тени)
	Lcd_Text_Format(0, 6, str_KVB_en, 1, 149, 108, 180);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	KVB_Delay(250);
	lcd_Set_Color_Font_RGB(255, 0, 0, 228, 0, 0, 0);//Цвета символов
	lcd_Set_Color_Font_RGB(60, 60, 60, 60, 60, 60, 2);//Цвета окантовки (тени)
	Lcd_Multi_three_Round(0, 9, 119, 10, 240, 120, 30, 5, 4, 0, 0, 0, 4, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Text_Format(0, 6, str_KVB_en, 1, 149, 108, 180);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	KVB_Delay(150);
	lcd_Set_Color_Font_RGB(0, 252, 252, 0, 160, 160, 0);//Цвета символов
	lcd_Set_Color_Font_RGB(80, 80, 80, 80, 80, 80, 2);//Цвета окантовки (тени)
	Lcd_Multi_three_Round(0, 1, 119, 10, 240, 120, 30, 5, 4, 0, 0, 0, 4, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Text_Format(0, 6, str_KVB_en, 1, 149, 108, 180);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	lcd_Set_Font(KVB_14x28_ER_ter_bold);//Функция установки отображаемого шрифта
	lcd_Set_Edging_Font(0);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	lcd_Set_Scale_Font(1);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения
	lcd_Set_Kerning_Font(1);//Функция установки кернинга шрифта (меж символьное расстояние) с коррекцией длины табуляции
	lcd_Set_Transparent_Font(0);//Функция установки подложки шрифта: 0 - не прозрачная подложка, 1 - прозрачная подложка
	
	lcd_Set_Color_Font_RGB(0, 0, 0, 0, 0, 0, 1);//Цвета подложки (1) и (2)
	lcd_Set_Color_Font_RGB(235, 150, 0, 0, 225, 225, 0);//Цвета символов

	Lcd_Text_Format(1, 1, str_prezent_ru, 1, 1, 170, 480);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	
	lcd_Set_Font(KVB_12x24_ER_ter_bold);//Функция установки отображаемого шрифта
	Lcd_Text_Format(1, 2, str_tel_ru, 1, 5, 285, 470);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	KVB_Delay(8000);
	
	Lcd_Fill_Screen_Ver_Scroll(0, 0);//Функция заливки экрана LCD панели одним цветом по индексу таблицы TColorHL при помощи вертикального сдвига LCD
	
	KVB_Delay(300);
//===========================================================================================	
//						Демонстрируем градиентные заливки экрана
//===========================================================================================
/*	Lcd_Grad_Fill_Screen(1, 0, 0, 1);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);*/
	Lcd_Grad_Fill_Screen(1, 0, 0, 2);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);

	Lcd_Grad_Fill_Screen(1, 1, 0, 1);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);
	Lcd_Grad_Fill_Screen(1, 1, 0, 2);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);
	Lcd_Grad_Fill_Screen(1, 1, 0, 3);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);

	Lcd_Grad_Fill_Screen(1, 7, 0, 1);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);
	Lcd_Grad_Fill_Screen(1, 7, 0, 2);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);
	Lcd_Grad_Fill_Screen(1, 7, 0, 3);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);

	Lcd_Grad_Fill_Screen(1, 8, 0, 1);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);
	Lcd_Grad_Fill_Screen(1, 8, 0, 2);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);
	Lcd_Grad_Fill_Screen(1, 8, 0, 3);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);

	Lcd_Grad_Fill_Screen(1, 9, 0, 1);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);
	Lcd_Grad_Fill_Screen(1, 9, 0, 2);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);
	Lcd_Grad_Fill_Screen(1, 9, 0, 3);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);
//===========================================================================================
//						Демонстрируем график из статичных двух синусоид
//===========================================================================================
	Lcd_Fill_Screen(0);//Функция заливки экрана LCD панели одним цветом по индексу таблицы TColorHL
	uint16_t i;
	Lcd_Line1(239, 15, 239, 304, 4);//Функции отображения линии толщиной в одну точку (1x1)
	Lcd_Line1(1, 159, 478, 159, 4);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 9; i < 470; i += 10)
	Lcd_Line1(i, 157, i, 161, 4);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 19; i < 300; i += 10)
	Lcd_Line1(237, i, 241, i, 4);//Функции отображения линии толщиной в одну точку (1x1)
	lcd_Open_Access();//Функция открытия доступа к LCD панели для разрешения циклов быстрого отображения точек
	for(i = 1; i < 478; i ++ )
	{
		LCD_Fast_Point(i,159 + (sin(((i * 1.13) * 3.14) / 180) * 95), 2);//Быстрое отображение точки цветом по индексу таблицы KVB.TColorHL
		LCD_Fast_Point(i,159 + (cos(((i * 1.13) * 3.14) / 180) * 95), 3);//Быстрое отображение точки цветом по индексу таблицы KVB.TColorHL
	}
	lcd_Close_Access();//Функция закрытия доступа к LCD панели для завершения циклов быстрого отображения точек
	KVB_Delay(2000);
//===========================================================================================
//					Демонстрируем график из одной динамичной синусоиды
//===========================================================================================
	uint16_t buf[478];
	uint16_t x = 1;
	uint16_t y;
	Lcd_Fill_Screen(0);//Функция заливки экрана LCD панели одним цветом по индексу таблицы TColorHL
	Lcd_Line1(239, 15, 239, 304, 4);//Функции отображения линии толщиной в одну точку (1x1)
	Lcd_Line1(1, 159, 478, 159, 4);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 9; i < 470; i += 10)
	Lcd_Line1(i, 157, i, 161, 4);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 19; i < 300; i += 10)
	Lcd_Line1(237, i, 241, i, 4);//Функции отображения линии толщиной в одну точку (1x1)
	lcd_Open_Access();//Функция открытия доступа к LCD панели для разрешения циклов быстрого отображения точек
	for(i = 1; i < (478 * 15); i++)
	{
		x++;
		if(x == 479) x = 1;
		if(i > 479)
		{
			if((x == 239) || (buf[x - 1] == 159)) LCD_Fast_Point(x, buf[x - 1], 4);//Быстрое отображение точки цветом по индексу таблицы KVB.TColorHL
			else LCD_Fast_Point(x, buf[x - 1], 0);//Быстрое отображение точки цветом по индексу таблицы KVB.TColorHL
		}
		y = 159 + (sin(((i * 0.7) * 3.14) / 180) * (90-(i / 100)));
		LCD_Fast_Point(x, y, 3);//Быстрое отображение точки цветом по индексу таблицы KVB.TColorHL
		buf[x - 1] = y;
	}
	lcd_Close_Access();//Функция закрытия доступа к LCD панели для завершения циклов быстрого отображения точек
	KVB_Delay(2000);
//===========================================================================================
//						Демонстрируем отображение изогнутых линий
//===========================================================================================
	lcd_Set_Font(KVB_13x38x4);//Функция установки отображаемого шрифта
	lcd_Set_Scale_Font(1);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения
	lcd_Set_Edging_Font(0);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	lcd_Set_Kerning_Font(0);//Функция установки кернинга шрифта (меж символьное расстояние) с коррекцией длины табуляции
	lcd_Set_Transparent_Font(0);//Функция установки подложки шрифта: 0 - не прозрачная подложка, 1 - прозрачная подложка
	lcd_Set_Color_Font_RGB(0, 255, 255, 0, 255, 255, 0);//Цвета символов с подложкой (1) и (2)
	lcd_Set_Color_Font_RGB(0, 0, 255, 255, 0, 0, 1);//Цвета подложки (1) и (2)

	Lcd_Grad_Fill_Screen(1, 1, 0, 2);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	Lcd_Grad_FillRect(1, 0, 0, 480, 15, 1, 1, 0);//Функция отображения закрашенного прямоугольника градиентным цветом из таблицы TGradColor или TGradColorFlash
	Lcd_Grad_FillRect(1, 0, 305, 480, 15, 1, 1, 1);//Функция отображения закрашенного прямоугольника градиентным цветом из таблицы TGradColor или TGradColorFlash

	Lcd_FillEquilateralTriangle(240, 160, 80, 0, 2);//Функция отображения закрашенного равностороннего треугольника
	Lcd_FillEquilateralTriangle(240, 160, 80, 1, 2);//Функция отображения закрашенного равностороннего треугольника
	Lcd_FillEquilateralTriangle(240, 160, 80, 2, 2);//Функция отображения закрашенного равностороннего треугольника
	Lcd_FillEquilateralTriangle(240, 160, 80, 3, 2);//Функция отображения закрашенного равностороннего треугольника
	Lcd_LineEquilateralTriangle(239, 159, 100, 0, 6, 1);//Функция отображения равностороннего треугольника толщиной в одну или две или три точки
	Lcd_LineEquilateralTriangle(239, 159, 100, 1, 6, 1);//Функция отображения равностороннего треугольника толщиной в одну или две или три точки
	Lcd_LineEquilateralTriangle(239, 159, 100, 2, 6, 1);//Функция отображения равностороннего треугольника толщиной в одну или две или три точки
	Lcd_LineEquilateralTriangle(239, 159, 100, 3, 6, 1);//Функция отображения равностороннего треугольника толщиной в одну или две или три точки

	Lcd_Text_Format(1, 2, str_KVB_en, 1, 190, 178, 100);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	for(i = 14; i < 305; i += 5) Lcd_Line1(0, i, (i * 1.6) - 15, 305, 5);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 305; i > 14; i -= 5) Lcd_Line1(479, i, (i * 1.6) - 15, 15, 5);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 305; i > 14; i -= 5) Lcd_Line1(0, i, 488 - (i * 1.6), 15, 3);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 14; i < 305; i += 5) Lcd_Line1(479, i, 502 - (i * 1.6), 304, 3);//Функции отображения линии толщиной в одну точку (1x1)

	KVB_Delay(4000);

	Lcd_Grad_Fill_Screen(1, 4, 0, 2);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	Lcd_Grad_FillRect(1, 0, 0, 480, 15, 10, 1, 0);//Функция отображения закрашенного прямоугольника градиентным цветом из таблицы TGradColor или TGradColorFlash
	Lcd_Grad_FillRect(1, 0, 305, 480, 15, 10, 1, 1);//Функция отображения закрашенного прямоугольника градиентным цветом из таблицы TGradColor или TGradColorFlash

	Lcd_FillEquilateralTriangle(240, 160, 80, 0, 4);//Функция отображения закрашенного равностороннего треугольника
	Lcd_FillEquilateralTriangle(240, 160, 80, 1, 4);//Функция отображения закрашенного равностороннего треугольника
	Lcd_FillEquilateralTriangle(240, 160, 80, 2, 4);//Функция отображения закрашенного равностороннего треугольника
	Lcd_FillEquilateralTriangle(240, 160, 80, 3, 4);//Функция отображения закрашенного равностороннего треугольника
	Lcd_LineEquilateralTriangle(239, 159, 100, 0, 5, 1);//Функция отображения равностороннего треугольника толщиной в одну или две или три точки
	Lcd_LineEquilateralTriangle(239, 159, 100, 1, 5, 1);//Функция отображения равностороннего треугольника толщиной в одну или две или три точки
	Lcd_LineEquilateralTriangle(239, 159, 100, 2, 5, 1);//Функция отображения равностороннего треугольника толщиной в одну или две или три точки
	Lcd_LineEquilateralTriangle(239, 159, 100, 3, 5, 1);//Функция отображения равностороннего треугольника толщиной в одну или две или три точки

	Lcd_Text_Format(1, 1, str_KVB_en, 1, 190, 178, 100);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	for(i = 14; i < 305; i += 5) Lcd_Line1(0, i, (i * 1.6) - 15, 305, 5);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 305; i > 14; i -= 5) Lcd_Line1(479, i, (i * 1.6) - 15, 15, 5);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 305; i > 14; i -= 5) Lcd_Line1(0, i, 488 - (i * 1.6), 15, 3);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 14; i < 305; i += 5) Lcd_Line1(479, i, 502 - (i * 1.6), 304, 3);//Функции отображения линии толщиной в одну точку (1x1)
	KVB_Delay(4000);
//===========================================================================================
//						Демонстрируем отображение прямых линий
//===========================================================================================
	Lcd_Grad_Fill_Screen(1, 7, 1, 1);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	for(i = 0; i <= 32; i++) Lcd_Line1(0, 0, i * 15, 320, 5);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 32; i > 0; i--) Lcd_Line1(0, 0, 480, i * 10 - 10, 5);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 32; i > 0; i--) Lcd_Line1(480, 320, i * 15, 0, 6);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 0; i <= 32; i++) Lcd_Line1(480, 320, 0, i * 10, 6);//Функции отображения линии толщиной в одну точку (1x1)
	KVB_Delay(3000);
	
	Lcd_Grad_Fill_Screen(1, 9, 1, 0);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	for(i = 32; i > 0; i--) Lcd_Line1(480, 320, i * 15, 0, 5);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 0; i <= 32; i++) Lcd_Line1(480, 320, 0, i * 10, 5);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 0; i <= 32; i++) Lcd_Line1(0, 0, i * 15, 320, 6);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 32; i > 0; i--) Lcd_Line1(0, 0, 480, i * 10 - 10, 6);//Функции отображения линии толщиной в одну точку (1x1)
	KVB_Delay(3000);
//===========================================================================================
//				Демонстрируем отображение вогнутого и выпуклого ромба
//===========================================================================================
	Lcd_Grad_Fill_Screen(1, 9, 2, 2);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	uint8_t cx = 240;
	uint8_t cy = 160;
	uint16_t size = 160;
	uint8_t step = 8;
	Lcd_Line1(cx - size, cy, cx + size, cy, 5); // Горизонталь Функции отображения линии толщиной в одну точку (1x1)
	for (uint16_t i = 0; i < size; i += step)
	{
		// Линии между осями X и Y в четырех квадрантах
		Lcd_Line1(cx + i, cy, cx, cy + (size - i), 5); // Верх-правый Функции отображения линии толщиной в одну точку (1x1)
		Lcd_Line1(cx - i, cy, cx, cy + (size - i), 5); // Верх-левый Функции отображения линии толщиной в одну точку (1x1)
		Lcd_Line1(cx + i, cy, cx, cy - (size - i), 5); // Низ-правый Функции отображения линии толщиной в одну точку (1x1)
		Lcd_Line1(cx - i, cy, cx, cy - (size - i), 5); // Низ-левый Функции отображения линии толщиной в одну точку (1x1)
	}

	cx = 80;
	cy = 0;
	size = 320;
	step = 8;
	for (uint16_t i = 0; i <= size; i += step)
	{
		uint16_t j = size - i;
		// Соединяем точки на смежных сторонах квадрата
		Lcd_Line1(cx + i, cy, cx + size, cy + i, 6);		// Верх-правый Функции отображения линии толщиной в одну точку (1x1)
		Lcd_Line1(cx + size, cy + i, cx + j, cy + size, 6);	// Низ-правый Функции отображения линии толщиной в одну точку (1x1)
		Lcd_Line1(cx + j, cy + size, cx, cy + j, 6);		// Низ-левый Функции отображения линии толщиной в одну точку (1x1)
		Lcd_Line1(cx, cy + j, cx + i, cy, 6);				// Верх-левый Функции отображения линии толщиной в одну точку (1x1)
	}
	KVB_Delay(4000);
//===========================================================================================
//						Отображаем простые графические примитивы
//===========================================================================================
	Lcd_Grad_Fill_Screen(1, 0, 0, 3);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash

	Lcd_FillRect(20, 40, 120, 80, 2);//Закрашенный прямоугольник
	Lcd_BorderRect(1, 180, 40, 120, 80, 5, 2, 6);//Прямоугольник c окантовкой и заливкой внутри
	Lcd_BorderRect(0, 340, 40, 120, 80, 5, 2, 6);//Прямоугольник c окантовкой и заливкой внутри

	Lcd_FillCircle(80, 240, 50, 2);//Закрашенная окружность
	Lcd_BorderCircle(1, 240, 240, 50, 5, 2, 6);//Окружность c окантовкой и заливкой внутри
	Lcd_BorderCircle(0, 400, 240, 50, 5, 2, 6);//Окружность c окантовкой и заливкой внутри

	KVB_Delay(2000);
//===========================================================================================
	Lcd_Grad_Fill_Screen(1, 0, 0, 3);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash

	Lcd_FillRoundRect(20, 40, 120, 80, 20, 2);//Закрашенный округлый прямоугольник
	Lcd_BorderRoundRect(1, 180, 40, 120, 80, 20, 5, 2, 6);//Округлый прямоугольник c окантовкой и заливкой внутри
	Lcd_BorderRoundRect(0, 340, 40, 120, 80, 20, 5, 2, 6);//Округлый прямоугольник c окантовкой и заливкой внутри

	Lcd_FillEquilateralTriangle(80, 240, 60, 0, 2);//Функция отображения закрашенного равностороннего треугольника
	Lcd_BorderEquilateralTriangle(1, 240, 240, 60, 5, 0, 2, 6);//Функция отображения равностороннего треугольника  c окантовкой и заливкой внутри
	Lcd_BorderEquilateralTriangle(0, 400, 240, 60, 5, 0, 2, 6);//Функция отображения равностороннего треугольника  c окантовкой и заливкой внутри

	KVB_Delay(2000);
//===========================================================================================
	Lcd_Grad_Fill_Screen(1, 0, 0, 3);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash

	Lcd_FillEllipse(80, 80, 60, 40, 2);//Закрашенный эллипс
	Lcd_BorderEllipse(1, 240, 80, 60, 40, 5, 2, 6);//Эллипс c окантовкой и заливкой внутри
	Lcd_BorderEllipse(0, 400, 80, 60, 40, 5, 2, 6);//Эллипс c окантовкой и заливкой внутри

	Lcd_FillEllipseRect(20, 200, 120, 80, 40, 28, 2);//Закрашенный округлый прямоугольник на основе эллипса
	Lcd_BorderEllipseRect(1, 180, 200, 120, 80, 40, 28, 5, 2, 6);//Округлый прямоугольник на основе эллипса c окантовкой и заливкой внутри
	Lcd_BorderEllipseRect(0, 340, 200, 120, 80, 40, 28, 5, 2, 6);//Округлый прямоугольник на основе эллипса c окантовкой и заливкой внутри

	KVB_Delay(2000);
//===========================================================================================
//	Отображения многофункционального трех поверхностного объекта Lcd_Multi_three_Round
//===========================================================================================
	Lcd_Fill_Screen(0);//Функция заливки экрана LCD панели одним цветом по индексу таблицы TColorHL
//===========================================================================================
	lcd_Set_Font(KVB_16x32_Nu_ter_bold);//Функция установки отображаемого шрифта
	lcd_Set_Transparent_Font(1);//Функция установки подложки шрифта: 0 - не прозрачная подложка, 1 - прозрачная подложка
	lcd_Set_Edging_Font(1);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	lcd_Set_Scale_Font(1);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения (работает только если Transparent = 0 или 2)
	lcd_Set_Kerning_Font(0);//Функция установки кернинга шрифта (меж символьное расстояние) с коррекцией длины табуляции
	lcd_Set_Spacing_Font(0);//Функция установки расстояния между строками
	lcd_Set_Aligning_Font(1);//Функция выравнивания строки текста 0 : Выравнивание по левому краю, 1 : Выравнивание по центру, 2 : Выравнивание по правому краю
//===========================================================================================
	Lcd_Multi_three_Round(0, 1, 127, 8, 70, 70, 35, 5, 3, 2, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 205, 8, 70, 70, 35, 5, 3, 2, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 283, 8, 70, 70, 35, 5, 3, 2, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(8);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 6, str_nu1, 1, 127, 52, 70);//1 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 6, str_nu2, 1, 205, 52, 70);//2 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 6, str_nu3, 1, 283, 52, 70);//3 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	Lcd_Multi_three_Round(0, 2, 127, 86, 70, 70, 35, 5, 3, 2, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 3, 205, 86, 70, 70, 35, 5, 3, 2, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 4, 283, 86, 70, 70, 35, 5, 3, 2, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(9);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 6, str_nu4, 1, 127, 130, 70);//4 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(10);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 6, str_nu5, 1, 205, 130, 70);//5 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(11);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 6, str_nu6, 1, 283, 130, 70);//6 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	Lcd_Multi_three_Round(0, 5, 127, 164, 70, 70, 35, 5, 3, 2, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 6, 205, 164, 70, 70, 35, 5, 3, 2, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 7, 283, 164, 70, 70, 35, 5, 3, 2, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(12);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 6, str_nu7, 1, 127, 208, 70);//7 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(13);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 6, str_nu8, 1, 205, 208, 70);//8 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(14);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 6, str_nu9, 1, 283, 208, 70);//9 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	Lcd_Multi_three_Round(0, 1, 127, 242, 70, 70, 35, 5, 3, 2, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 205, 242, 70, 70, 35, 5, 3, 2, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 283, 242, 70, 70, 35, 5, 3, 2, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(8);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 6, str_nu0, 1, 127, 286, 70);//0 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 6, str_nu10, 1, 205, 286, 70);//# Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 6, str_nu11, 1, 283, 286, 70);//* Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
//-------------------------------------------------------------------------------------------
	KVB_Delay(500);
	Lcd_Multi_three_Round(0, 8, 127, 8, 70, 70, 35, 5, 3, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(300);
	Lcd_Multi_three_Round(0, 9, 127, 8, 70, 70, 35, 5, 3, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
//-------------------------------------------------------------------------------------------
	KVB_Delay(150);
	Lcd_Multi_three_Round(0, 1, 127, 8, 70, 70, 35, 5, 3, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(500);
	Lcd_Multi_three_Round(0, 8, 205, 8, 70, 70, 35, 5, 3, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(300);
	Lcd_Multi_three_Round(0, 9, 205, 8, 70, 70, 35, 5, 3, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
//-------------------------------------------------------------------------------------------
	KVB_Delay(150);
	Lcd_Multi_three_Round(0, 1, 205, 8, 70, 70, 35, 5, 3, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(500);
	Lcd_Multi_three_Round(0, 8, 283, 8, 70, 70, 35, 5, 3, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(300);
	Lcd_Multi_three_Round(0, 9, 283, 8, 70, 70, 35, 5, 3, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
//-------------------------------------------------------------------------------------------
	KVB_Delay(150);
	Lcd_Multi_three_Round(0, 1, 283, 8, 70, 70, 35, 5, 3, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(500);
	Lcd_Multi_three_Round(0, 8, 127, 86, 70, 70, 35, 5, 3, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(300);
	Lcd_Multi_three_Round(0, 11, 127, 86, 70, 70, 35, 5, 3, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
//-------------------------------------------------------------------------------------------
	KVB_Delay(150);
	Lcd_Multi_three_Round(0, 2, 127, 86, 70, 70, 35, 5, 3, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(500);
	Lcd_Multi_three_Round(0, 8, 205, 86, 70, 70, 35, 5, 3, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(300);
	Lcd_Multi_three_Round(0, 9, 205, 86, 70, 70, 35, 5, 3, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
//-------------------------------------------------------------------------------------------
	KVB_Delay(150);
	Lcd_Multi_three_Round(0, 3, 205, 86, 70, 70, 35, 5, 3, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(500);
	Lcd_Multi_three_Round(0, 8, 283, 86, 70, 70, 35, 5, 3, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(300);
	Lcd_Multi_three_Round(0, 9, 283, 86, 70, 70, 35, 5, 3, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(150);
	Lcd_Multi_three_Round(0, 4, 283, 86, 70, 70, 35, 5, 3, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(1000);
//===========================================================================================
	Lcd_Fill_Screen(0);//Функция заливки экрана LCD панели одним цветом по индексу таблицы TColorHL
	Lcd_Multi_three_Round(0, 1, 127, 8, 70, 70, 35, 4, 3, 4, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 205, 8, 70, 70, 35, 4, 3, 4, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 283, 8, 70, 70, 35, 4, 3, 4, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 4, str_nu1, 1, 127, 52, 70);//1 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 4, str_nu2, 1, 205, 52, 70);//2 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 4, str_nu3, 1, 283, 52, 70);//3 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	Lcd_Multi_three_Round(0, 2, 127, 86, 70, 70, 35, 4, 3, 4, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 3, 205, 86, 70, 70, 35, 4, 3, 4, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 4, 283, 86, 70, 70, 35, 4, 3, 4, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(2);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 4, str_nu4, 1, 127, 130, 70);//4 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(3);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 4, str_nu5, 1, 205, 130, 70);//5 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(4);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 4, str_nu6, 1, 283, 130, 70);//6 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	Lcd_Multi_three_Round(0, 5, 127, 164, 70, 70, 35, 4, 3, 4, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 6, 205, 164, 70, 70, 35, 4, 3, 4, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 7, 283, 164, 70, 70, 35, 4, 3, 4, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(5);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 4, str_nu7, 1, 127, 208, 70);//7 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(6);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 4, str_nu8, 1, 205, 208, 70);//8 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(7);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 4, str_nu9, 1, 283, 208, 70);//9 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	Lcd_Multi_three_Round(0, 1, 127, 242, 70, 70, 35, 4, 3, 4, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 205, 242, 70, 70, 35, 4, 3, 4, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 283, 242, 70, 70, 35, 4, 3, 4, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 4, str_nu0, 1, 127, 286, 70);//0 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 4, str_nu10, 1, 205, 286, 70);//# Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 4, str_nu11, 1, 283, 286, 70);//* Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	KVB_Delay(4000);
//===========================================================================================
	Lcd_Fill_Screen(0);//Функция заливки экрана LCD панели одним цветом по индексу таблицы TColorHL
	Lcd_Multi_three_Round(0, 1, 127, 8, 70, 70, 35, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 205, 8, 70, 70, 35, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 283, 8, 70, 70, 35, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Text_Format(0, 3, str_nu1, 1, 127, 54, 70);//1 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 3, str_nu2, 1, 205, 54, 70);//2 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 3, str_nu3, 1, 283, 54, 70);//3 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	Lcd_Multi_three_Round(0, 2, 127, 86, 70, 70, 35, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 3, 205, 86, 70, 70, 35, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 4, 283, 86, 70, 70, 35, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(2);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu4, 1, 127, 132, 70);//4 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(3);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu5, 1, 205, 132, 70);//5 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(4);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu6, 1, 283, 132, 70);//6 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	Lcd_Multi_three_Round(0, 5, 127, 164, 70, 70, 35, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 6, 205, 164, 70, 70, 35, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 7, 283, 164, 70, 70, 35, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(5);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu7, 1, 127, 210, 70);//7 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(6);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu8, 1, 205, 210, 70);//8 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(7);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu9, 1, 283, 210, 70);//9 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	Lcd_Multi_three_Round(0, 1, 127, 242, 70, 70, 35, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 205, 242, 70, 70, 35, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 283, 242, 70, 70, 35, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu0, 1, 127, 288, 70);//0 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 3, str_nu10, 1, 205, 288, 70);//# Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 3, str_nu11, 1, 283, 288, 70);//* Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	KVB_Delay(2000);
//===========================================================================================
	Lcd_Fill_Screen(0);//Функция заливки экрана LCD панели одним цветом по индексу таблицы TColorHL
	Lcd_Multi_three_Round(0, 1, 127, 8, 70, 70, 20, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 205, 8, 70, 70, 20, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 283, 8, 70, 70, 20, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu1, 1, 127, 54, 70);//1 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 3, str_nu2, 1, 205, 54, 70);//2 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 3, str_nu3, 1, 283, 54, 70);//3 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	Lcd_Multi_three_Round(0, 2, 127, 86, 70, 70, 22, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 3, 205, 86, 70, 70, 22, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 4, 283, 86, 70, 70, 22, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(2);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu4, 1, 127, 132, 70);//4 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(3);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu5, 1, 205, 132, 70);//5 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(4);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu6, 1, 283, 132, 70);//6 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	Lcd_Multi_three_Round(0, 5, 127, 164, 70, 70, 22, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 6, 205, 164, 70, 70, 22, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 7, 283, 164, 70, 70, 22, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(5);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu7, 1, 127, 210, 70);//7 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(6);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu8, 1, 205, 210, 70);//8 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(7);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu9, 1, 283, 210, 70);//9 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	Lcd_Multi_three_Round(0, 1, 127, 242, 70, 70, 22, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 205, 242, 70, 70, 22, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 283, 242, 70, 70, 22, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu0, 1, 127, 288, 70);//0 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 3, str_nu10, 1, 205, 288, 70);//# Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 3, str_nu11, 1, 283, 288, 70);//* Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	KVB_Delay(5000);
//===========================================================================================
//							Печать и форматирование текста
//===========================================================================================
	Lcd_Fill_Screen(0);//Функция заливки экрана LCD панели одним цветом по индексу таблицы TColorHL
//===========================================================================================
//test01:
	//lcd_Set_Font(KVB_5x12_ER_sans_normal);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_6x12_ER_ter_normal);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_7x12_ER_sans_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_8x14_ER_serif_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_8x14_ER_ter_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_8x14_ER_ter_normal);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_8x16_ER_serif_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_8x16_ER_ter_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_8x16_ER_ter_normal);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_10x18_ER_serif_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_10x18_ER_ter_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_10x18_ER_ter_normal);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_10x20_ER_serif_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_10x20_ER_ter_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_10x20_ER_ter_normal);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_11x22_ER_ter_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_11x22_ER_ter_normal);//Функция установки отображаемого шрифта
	lcd_Set_Font(KVB_12x24_ER_ter_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_12x24_ER_ter_normal);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_14x28_ER_ter_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_14x28_ER_ter_normal);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_16x32_ER_ter_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_16x32_ER_ter_normal);//Функция установки отображаемого шрифта
//===========================================================================================
	lcd_Set_Kerning_Font(0);//Функция установки кернинга шрифта (меж символьное расстояние) с коррекцией длины табуляции
	lcd_Set_Spacing_Font(0);//Функция установки расстояния между строками
	lcd_Set_Transparent_Font(0);//Функция установки подложки шрифта: 0 - не прозрачная подложка, 1 - прозрачная подложка
	lcd_Set_Aligning_Font(0);//Функция выравнивания строки текста 0 : Выравнивание по левому краю, 1 : Выравнивание по центру, 2 : Выравнивание по правому краю
	lcd_Set_Edging_Font(0);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	lcd_Set_Scale_Font(1);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения (работает только если Transparent = 0 или 2)
//===========================================================================================
	lcd_Set_Color_Font_RGB(0, 0, 0, 0, 0, 0, 1);//Цвета подложки
	lcd_Set_Color_Font_RGB(250, 250, 0, 0, 250, 250, 0);//Цвета символов
	lcd_Set_Scale_Font(2);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения
	lcd_Set_Aligning_Font(1);//Функция выравнивания строки текста 0 : Выравнивание по левому краю, 1 : Выравнивание по центру, 2 : Выравнивание по правому краю
	Lcd_Text_Format(0, 1, str_test1a_ru, 1, 5, 40, 470);//Перенос по словам Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Scale_Font(1);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения
	lcd_Set_Aligning_Font(0);//Функция выравнивания строки текста 0 : Выравнивание по левому краю, 1 : Выравнивание по центру, 2 : Выравнивание по правому краю
	Lcd_Text_Format(0, 2, str_test1_ru, 1, 5, 80, 470);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 1, str_test1_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 2, str_test1_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 1, str_test2_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	double sdf = -2350.651;
	lcd_Set_Color_Font_RGB(250, 250, 0, 140, 255, 140, 0);//Цвета символов
	Lcd_Text_NumberF(0, 2, sdf, 0, 0, 0, 3, ',', 12, '0');//Функция вывода на дисплей вещественного числа или содержимое переменной вещественного типа
	Lcd_Text_Format(0, 1, str_test1_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 1, str_test1_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	KVB_Delay(4000);
//===========================================================================================
	lcd_Set_TGradColor_RGB(100,0,200,255,100,100,0);//Функция установки градиента цвета в таблицу TGradColor из формата RGB по индексу
	Lcd_Grad_Fill_Screen(0, 0, 0, 3);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	lcd_Set_Color_Font_RGB(0, 0, 0, 0, 0, 0, 2);//Цвета окантовки (тени)
	lcd_Set_Color_Font_RGB(250, 250, 0, 0, 250, 250, 0);//Цвета символов
	lcd_Set_Transparent_Font(1);//Функция установки подложки шрифта: 0 - не прозрачная подложка, 1 - прозрачная подложка
	lcd_Set_Scale_Font(2);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения
	lcd_Set_Aligning_Font(1);//Функция выравнивания строки текста 0 : Выравнивание по левому краю, 1 : Выравнивание по центру, 2 : Выравнивание по правому краю
	Lcd_Text_Format(0, 1, str_test1a_ru, 1, 5, 40, 470);//Перенос по словам Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Scale_Font(1);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения
	lcd_Set_Aligning_Font(0);//Функция выравнивания строки текста 0 : Выравнивание по левому краю, 1 : Выравнивание по центру, 2 : Выравнивание по правому краю
	Lcd_Text_Format(0, 2, str_test1_ru, 1, 5, 80, 470);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 1, str_test1_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 2, str_test1_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 1, str_test2_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Color_Font_RGB(250, 250, 0, 140, 255, 140, 0);//Цвета символов
	Lcd_Text_NumberF(0, 2, sdf, 0, 0, 0, 3, ',', 12, '0');//Функция вывода на дисплей вещественного числа или содержимое переменной вещественного типа
	Lcd_Text_Format(0, 1, str_test1_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 1, str_test1_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	KVB_Delay(4000);
//===========================================================================================
	lcd_Set_Color_Font_RGB(250, 250, 0, 0, 250, 250, 0);//Цвета символов;
	Lcd_Grad_Fill_Screen(0, 0, 0, 3);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	lcd_Set_Scale_Font(2);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения
	lcd_Set_Aligning_Font(1);//Функция выравнивания строки текста 0 : Выравнивание по левому краю, 1 : Выравнивание по центру, 2 : Выравнивание по правому краю
	lcd_Set_Edging_Font(5);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	lcd_Set_Color_Font_RGB(250, 250, 0, 0, 250, 250, 2);//Цвета окантовки шрифта
	lcd_Set_Kerning_Font(3);//Функция установки кернинга шрифта (меж символьное расстояние) с коррекцией длины табуляции
	Lcd_Text_Format(0, 0, str_test1b_ru, 1, 5, 40, 470);//Текст с тенью Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Kerning_Font(0);//Функция установки кернинга шрифта (меж символьное расстояние) с коррекцией длины табуляции
	lcd_Set_Color_Font_RGB(0, 0, 0, 0, 0, 0, 2);//Цвета окантовки шрифта
	lcd_Set_Scale_Font(1);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения
	lcd_Set_Aligning_Font(0);//Функция выравнивания строки текста 0 : Выравнивание по левому краю, 1 : Выравнивание по центру, 2 : Выравнивание по правому краю
	lcd_Set_Edging_Font(1);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	Lcd_Text_Format(0, 2, str_test1_ru, 1, 5, 80, 470);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 1, str_test1_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 2, str_test1_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 1, str_test2_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Color_Font_RGB(250, 250, 0, 140, 255, 140, 0);//Цвета символов
	Lcd_Text_NumberF(0, 2, sdf, 0, 0, 0, 3, ',', 12, '0');//Функция вывода на дисплей вещественного числа или содержимое переменной вещественного типа
	Lcd_Text_Format(0, 1, str_test1_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 1, str_test1_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	KVB_Delay(4000);
//===========================================================================================
//						Последняя страница отображения LCD панели
//===========================================================================================
	//test01:
	lcd_Set_TColor_RGB(0, 0, 0, 0);//Функция установки цветов в таблицу TColorHL из формата RGB по индексу
	Lcd_Fill_Screen(0);//Функция заливки экрана LCD панели одним цветом по индексу
//-------------------------------------------------------------------------------------------
	lcd_Set_Font(KVB_14x28_ER_ter_bold);//Функция установки отображаемого шрифта
	lcd_Set_Color_Font_RGB(0, 0, 0, 0, 0, 0, 2);//Цвета окантовки (тени)
	lcd_Set_Kerning_Font(0);//Функция установки кернинга шрифта (меж символьное расстояние) с коррекцией длины табуляции
	lcd_Set_Edging_Font(1);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	lcd_Set_Scale_Font(1);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения (работает только если Transparent = 0 или 2)
	lcd_Set_Aligning_Font(1);//Функция выравнивания строки текста 0 : Выравнивание по левому краю, 1 : Выравнивание по центру, 2 : Выравнивание по правому краю
//-------------------------------------------------------------------------------------------
//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0,//Формат визуализации 0 = вертикальный, 1 = горизонтальный
					1,	//Индекс цвета кнопки из программной памяти начиная с 1, если 0 то из оперативной памяти
					//---------------------------------------------------------------------------
					20,	//Верхняя левая точка начала объекта по оси X (горизонтали)
					0,	//Верхняя левая точка начала объекта по оси Y (вертикали)
					100,//Ширина объекта
					50,	//Высота объекта
					//---------------------------------------------------------------------------
					16,	//Наружный радиус окружности
					5,	//Формат отображения внешней поверхности: 0 = не отображать, 1 = светлый цвет, 2 = темный цвет, 3 = линейный градиент от темного к светлому, 4 = линейный градиент от светлого к темному, 5 = центральный градиент от темного к светлому и обратно к темному, 6 = центральный градиент от светлого к темному и обратно к светлому
					//---------------------------------------------------------------------------
					3,	//Окантовка - бордюр от наружного радиуса внутрь, если 0 то не отображается
					5,	//Формат отображения внутренней поверхности: 0 = не отображать, 1 = светлый цвет, 2 = темный цвет, 3 = вертикальный градиент от темного к светлому, 4 = вертикальный градиент от светлого к темному, 5 = центральный градиент от темного к светлому и обратно к темному, 6 = центральный градиент от светлого к темному и обратно к светлому
					0,	//Смещение внутренней поверхности по оси X
					0,	//Смещение внутренней поверхности по оси Y
					//---------------------------------------------------------------------------
					3,	//Окантовка - бордюр от наружного радиуса внутрь, если 0 то не отображается
					6,	//Формат отображения внутренней поверхности: 0 = не отображать, 1 = светлый цвет, 2 = темный цвет, 3 = линейный градиент от темного к светлому, 4 = линейный градиент от светлого к темному, 5 = центральный градиент от темного к светлому и обратно к темному, 6 = центральный градиент от светлого к темному и обратно к светлому
					0,	//Смещение внутренней поверхности по оси X
					0);	//Смещение внутренней поверхности по оси Y
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 6, str_button1_ru, 1, 20, 33, 100);//ВВЕРХ Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
//-------------------------------------------------------------------------------------------
	Lcd_Multi_three_Round(1, 1, 130, 0, 100, 50, 16, 5, 3, 5, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(1, 6, str_button2_ru, 1, 130, 33, 100);//ВИДЕО Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
//-------------------------------------------------------------------------------------------
	Lcd_Multi_three_Round(0, 1, 240, 0, 100, 50, 16, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_button3_ru, 1, 240, 34, 100);//НАЗАД Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
//-------------------------------------------------------------------------------------------
	Lcd_Multi_three_Round(1, 1, 350, 0, 100, 50, 16, 3, 3, 4, 0, 0, 3, 4, 0, 1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(1, 3, str_button4_ru, 1, 350, 33, 100);//СБРОС Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
//-------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------
	Lcd_Multi_three_Round(0, 1, 20, 60, 100, 50, 16, 6, 3, 6, 0, 0, 3, 5, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	lcd_Set_Edging_Font(3);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	Lcd_Text_Format(0, 5, str_button5_ru, 1, 20, 93, 100);//ВНИЗ Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
//-------------------------------------------------------------------------------------------
	Lcd_Multi_three_Round(1, 1, 130, 60, 100, 50, 16, 6, 3, 6, 0, 0, 3, 5, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	lcd_Set_Edging_Font(3);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	Lcd_Text_Format(1, 5, str_button6_ru, 1, 130, 93, 100);//СТАРТ Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
//-------------------------------------------------------------------------------------------
	Lcd_Multi_three_Round(0, 1, 240, 60, 100, 50, 16, 4, 3, 3, 0, 0, 3, 3, 0, -1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	lcd_Set_Edging_Font(3);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	Lcd_Text_Format(0, 4, str_button7_ru, 1, 240, 92, 100);//ЗВУКИ Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
//-------------------------------------------------------------------------------------------
	Lcd_Multi_three_Round(1, 1, 350, 60, 100, 50, 16, 4, 3, 3, 0, 0, 3, 3, 0, -1);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	lcd_Set_Edging_Font(2);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	Lcd_Text_Format(1, 4, str_button8_ru, 1, 350, 93, 100);//АУДИО Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
//-------------------------------------------------------------------------------------------
	lcd_Set_Spacing_Font(-5);//Функция установки расстояния между строками
	lcd_Set_Edging_Font(0);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	lcd_Set_Scale_Font(2);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения

	lcd_Set_Color_Font_RGB(255, 150, 0, 0, 150, 255, 0);//Цвета символов
	lcd_Set_Color_Font_RGB(190, 0, 0, 0, 30, 180, 1);//Цвета подложки
	lcd_Set_Color_Font_RGB(200, 200, 200, 200, 200, 200, 2);//Цвета окантовки (тени)

	Lcd_Text_Format(1, 5, str_LCD_en, 1, 1, 175, 480);//KVB-16bit-ILI9481\nATmega128A Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
//-------------------------------------------------------------------------------------------
	lcd_Set_Color_Font_RGB(0, 100, 255, 255, 0, 0, 0);//Цвета символов
	lcd_Set_Edging_Font(5);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	lcd_Set_Kerning_Font(1);//Функция установки кернинга шрифта (меж символьное расстояние) с коррекцией длины табуляции
	Lcd_Text_Format(0, 3, str_IDE_en, 1, 5, 290, 470);//Atmel Studio 7.0 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
//-------------------------------------------------------------------------------------------
	KVB_Delay(4000);
//===========================================================================================
//						Переводим LCD панель в спящий режим и обратно
//===========================================================================================
	lcd_Display_Off();//Функция отключения дисплея (Вход в режим энергосбережения)
	KVB_Delay(2000);
	lcd_Display_On();//Функция включения дисплея (Выход из режима сна)
	KVB_Delay(500);
}
//###########################################################################################
//			Функция тестирования LCD панели с разрешением 320x240 горизонтальная
//###########################################################################################
void lcd_Test320x240Landscape(void)
{
//===========================================================================================
//					Установка восьми простых цветов заливки экрана
//===========================================================================================
	lcd_Set_TColor_RGB(0, 0, 0, 0);//Черный
	lcd_Set_TColor_RGB(255, 255, 255, 1);//Белый
	lcd_Set_TColor_RGB(255, 0, 0, 2);//Красный
	lcd_Set_TColor_RGB(0, 255, 0, 3);//Зелёный
	lcd_Set_TColor_RGB(0, 0, 255, 4);//Синий
	lcd_Set_TColor_RGB(255, 255, 0, 5);//Жёлтый
	lcd_Set_TColor_RGB(0, 255, 255, 6);//Голубой
	lcd_Set_TColor_RGB(255, 0, 255, 7);//Фиолетовый
	/*
	lcd_Set_TColor_RGB565(BLACK, 0);//Черный
	lcd_Set_TColor_RGB565(WHITE, 1);//Белый
	lcd_Set_TColor_RGB565(RED, 2);//Красный
	lcd_Set_TColor_RGB565(LIME, 3);//Зелёный
	lcd_Set_TColor_RGB565(BLUE, 4);//Синий
	lcd_Set_TColor_RGB565(YELLOW, 5);//Жёлтый
	lcd_Set_TColor_RGB565(CYAN, 6);//Голубой
	lcd_Set_TColor_RGB565(MAGENTA, 7);//Фиолетовый
	*/
//===========================================================================================
//							Демонстрируем логотип и автора
//===========================================================================================
	Lcd_Fill_Screen(0);//Функция заливки экрана LCD панели одним цветом по индексу таблицы TColorHL
	KVB_Delay(1000);
	lcd_Set_Font(KVB_13x38x4);//Функция установки отображаемого шрифта
	lcd_Set_Nsymtab_Font(4);//Функция установки количества символов в горизонтальной табуляции
	lcd_Set_Transparent_Font(1);//Функция установки подложки шрифта: 0 - не прозрачная подложка, 1 - прозрачная подложка
	lcd_Set_Spacing_Font(0);//Функция установки расстояния между строками
	lcd_Set_Aligning_Font(1);//Функция выравнивания строки текста 0 : Выравнивание по левому краю, 1 : Выравнивание по центру, 2 : Выравнивание по правому краю
	lcd_Set_Scale_Font(1);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения
	lcd_Set_Edging_Font(0);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	lcd_Set_Kerning_Font(0);//Функция установки кернинга шрифта (меж символьное расстояние) с коррекцией длины табуляции
	Lcd_Multi_three_Round(0, 1, 80, 5, 160, 80, 22, 5, 3, 6, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Color_Font_RGB(0, 252, 252, 0, 180, 180, 0);//Цвет символов
	lcd_Set_Color_Font_RGB(80, 80, 80, 80, 80, 80, 2);//Цвет окантовки (тени)
	Lcd_Text_Format(0, 6, str_KVB_en, 1, 100, 63, 120);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	KVB_Delay(1000);
	
	Lcd_Multi_three_Round(0, 12, 80, 5, 160, 80, 22, 5, 3, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(12);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	lcd_Set_Color_Font_RGB(255, 255, 0, 228, 228, 0, 0);//Цвета символов
	lcd_Set_Color_Font_RGB(60, 60, 60, 60, 60, 60, 2);//Цвета окантовки (тени)
	Lcd_Text_Format(0, 6, str_KVB_en, 1, 100, 63, 120);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	KVB_Delay(250);
	lcd_Set_Color_Font_RGB(255, 0, 0, 228, 0, 0, 0);//Цвета символов
	lcd_Set_Color_Font_RGB(60, 60, 60, 60, 60, 60, 2);//Цвета окантовки (тени)
	Lcd_Multi_three_Round(0, 9, 80, 5, 160, 80, 22, 5, 3, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Text_Format(0, 6, str_KVB_en, 1, 100, 63, 120);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	KVB_Delay(150);
	lcd_Set_Color_Font_RGB(0, 252, 252, 0, 180, 180, 0);//Цвета символов
	lcd_Set_Color_Font_RGB(80, 80, 80, 80, 80, 80, 2);//Цвета окантовки (тени)
	Lcd_Multi_three_Round(0, 1, 80, 5, 160, 80, 22, 5, 3, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Text_Format(0, 6, str_KVB_en, 1, 100, 63, 120);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	lcd_Set_Font(KVB_10x20_ER_ter_bold);//Функция установки отображаемого шрифта
	lcd_Set_Edging_Font(0);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	lcd_Set_Scale_Font(1);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения
	lcd_Set_Kerning_Font(1);//Функция установки кернинга шрифта (меж символьное расстояние) с коррекцией длины табуляции
	lcd_Set_Transparent_Font(0);//Функция установки подложки шрифта: 0 - не прозрачная подложка, 1 - прозрачная подложка
	
	lcd_Set_Color_Font_RGB(0, 0, 0, 0, 0, 0, 1);//Цвета подложки (1) и (2)
	lcd_Set_Color_Font_RGB(235, 150, 0, 0, 225, 225, 0);//Цвета символов

	Lcd_Text_Format(1, 1, str_prezent_ru, 1, 1, 110, 320);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	
	lcd_Set_Font(KVB_10x18_ER_ter_bold);//Функция установки отображаемого шрифта
	Lcd_Text_Format(1, 2, str_tel_ru, 1, 5, 218, 310);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	KVB_Delay(8000);
	
	Lcd_Fill_Screen_Ver_Scroll(0, 0);//Функция заливки экрана LCD панели одним цветом по индексу таблицы TColorHL при помощи вертикального сдвига LCD
	
	KVB_Delay(300);
//===========================================================================================	
//						Демонстрируем градиентные заливки экрана
//===========================================================================================
	Lcd_Grad_Fill_Screen(1, 0, 0, 2);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);

	Lcd_Grad_Fill_Screen(1, 1, 0, 1);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);
	Lcd_Grad_Fill_Screen(1, 1, 0, 2);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);
	Lcd_Grad_Fill_Screen(1, 1, 0, 3);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);

	Lcd_Grad_Fill_Screen(1, 7, 0, 1);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);
	Lcd_Grad_Fill_Screen(1, 7, 0, 2);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);
	Lcd_Grad_Fill_Screen(1, 7, 0, 3);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);

	Lcd_Grad_Fill_Screen(1, 8, 0, 1);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);
	Lcd_Grad_Fill_Screen(1, 8, 0, 2);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);
	Lcd_Grad_Fill_Screen(1, 8, 0, 3);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);

	Lcd_Grad_Fill_Screen(1, 9, 0, 1);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);
	Lcd_Grad_Fill_Screen(1, 9, 0, 2);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);
	Lcd_Grad_Fill_Screen(1, 9, 0, 3);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	KVB_Delay(1200);
//===========================================================================================
//						Демонстрируем график из статичных двух синусоид
//===========================================================================================
	Lcd_Fill_Screen(0);//Функция заливки экрана LCD панели одним цветом по индексу таблицы TColorHL
	uint16_t i;
	Lcd_Line1(159, 10, 159, 229, 4);//Функции отображения линии толщиной в одну точку (1x1)
	Lcd_Line1(1, 119, 318, 119, 4);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 4; i < 320; i += 10)
	Lcd_Line1(i, 117, i, 121, 4);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 14; i < 230; i += 10)
	Lcd_Line1(157, i, 161, i, 4);//Функции отображения линии толщиной в одну точку (1x1)
	lcd_Open_Access();//Функция открытия доступа к LCD панели для разрешения циклов быстрого отображения точек
	for(i = 1; i < 318; i ++ )
	{
		LCD_Fast_Point(i,119 + (sin(((i * 1.7) * 3.14) / 270) * 95), 2);//Быстрое отображение точки цветом по индексу таблицы KVB.TColorHL
		LCD_Fast_Point(i,119 + (cos(((i * 1.7) * 3.14) / 270) * 95), 3);//Быстрое отображение точки цветом по индексу таблицы KVB.TColorHL
	}
	lcd_Close_Access();//Функция закрытия доступа к LCD панели для завершения циклов быстрого отображения точек
	KVB_Delay(2000);
//===========================================================================================
//					Демонстрируем график из одной динамичной синусоиды
//===========================================================================================
	uint16_t x = 1;
	uint16_t y;
	uint16_t buf[318];
	Lcd_Fill_Screen(0);//Функция заливки экрана LCD панели одним цветом по индексу таблицы TColorHL
	Lcd_Line1(159, 10, 159, 229, 4);//Функции отображения линии толщиной в одну точку (1x1)
	Lcd_Line1(1, 119, 318, 119, 4);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 4; i < 320; i += 10)
	Lcd_Line1(i, 117, i, 121, 4);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 14; i < 230; i += 10)
	Lcd_Line1(157, i, 161, i, 4);//Функции отображения линии толщиной в одну точку (1x1)
	lcd_Open_Access();//Функция открытия доступа к LCD панели для разрешения циклов быстрого отображения точек
	for(i = 1; i < (318 * 15); i++)
	{
		x++;
		if(x == 319) x = 1;
		if(i > 319)
		{
			if((x == 159) || (buf[x - 1] == 119)) LCD_Fast_Point(x, buf[x - 1], 4);//Быстрое отображение точки цветом по индексу таблицы KVB.TColorHL
			else LCD_Fast_Point(x, buf[x - 1], 0);//Быстрое отображение точки цветом по индексу таблицы KVB.TColorHL
		}
		y = 119 + (sin(((i * 0.7035) * 3.14) / 120) * (60-(i / 100)));
		LCD_Fast_Point(x, y, 3);//Быстрое отображение точки цветом по индексу таблицы KVB.TColorHL
		buf[x - 1] = y;
	}
	lcd_Close_Access();//Функция закрытия доступа к LCD панели для завершения циклов быстрого отображения точек
	KVB_Delay(2000);
//===========================================================================================
//						Демонстрируем отображение изогнутых линий
//===========================================================================================
	lcd_Set_Font(KVB_13x38x4);//Функция установки отображаемого шрифта
	lcd_Set_Scale_Font(1);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения
	lcd_Set_Edging_Font(0);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	lcd_Set_Kerning_Font(0);//Функция установки кернинга шрифта (меж символьное расстояние) с коррекцией длины табуляции
	lcd_Set_Transparent_Font(0);//Функция установки подложки шрифта: 0 - не прозрачная подложка, 1 - прозрачная подложка
	lcd_Set_Color_Font_RGB(0, 255, 255, 0, 255, 255, 0);//Цвета символов с подложкой (1) и (2)
	lcd_Set_Color_Font_RGB(0, 0, 255, 255, 0, 0, 1);//Цвета подложки (1) и (2)

	Lcd_Grad_Fill_Screen(1, 1, 0, 2);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	Lcd_Grad_FillRect(1, 0, 0, 320, 15, 1, 1, 0);//Функция отображения закрашенного прямоугольника градиентным цветом из таблицы TGradColor или TGradColorFlash
	Lcd_Grad_FillRect(1, 0, 225, 320, 15, 1, 1, 1);//Функция отображения закрашенного прямоугольника градиентным цветом из таблицы TGradColor или TGradColorFlash

	Lcd_FillEquilateralTriangle(160, 120, 60, 0, 2);//Функция отображения закрашенного равностороннего треугольника
	Lcd_FillEquilateralTriangle(160, 120, 60, 1, 2);//Функция отображения закрашенного равностороннего треугольника
	Lcd_FillEquilateralTriangle(160, 120, 60, 2, 2);//Функция отображения закрашенного равностороннего треугольника
	Lcd_FillEquilateralTriangle(160, 120, 60, 3, 2);//Функция отображения закрашенного равностороннего треугольника
	Lcd_LineEquilateralTriangle(159, 119, 75, 0, 3, 1);//Функция отображения равностороннего треугольника толщиной в одну или две или три точки
	Lcd_LineEquilateralTriangle(159, 119, 75, 1, 3, 1);//Функция отображения равностороннего треугольника толщиной в одну или две или три точки
	Lcd_LineEquilateralTriangle(159, 119, 75, 2, 3, 1);//Функция отображения равностороннего треугольника толщиной в одну или две или три точки
	Lcd_LineEquilateralTriangle(159, 119, 75, 3, 3, 1);//Функция отображения равностороннего треугольника толщиной в одну или две или три точки

	Lcd_Text_Format(1, 2, str_KVB_en, 1, 110, 138, 100);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	for(i = 14; i < 225; i += 5) Lcd_Line1(0, i, (i * 1.33) - 15, 225, 5);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 225; i > 14; i -= 5) Lcd_Line1(319, i, (i * 1.33) + 15, 15, 5);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 225; i > 14; i -= 5) Lcd_Line1(0, i, 305 - (i * 1.33), 15, 3);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 14; i < 225; i += 5) Lcd_Line1(319, i, 334 - (i * 1.33), 224, 3);//Функции отображения линии толщиной в одну точку (1x1)

	KVB_Delay(4000);

	Lcd_Grad_Fill_Screen(1, 4, 0, 2);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	Lcd_Grad_FillRect(1, 0, 0, 320, 15, 10, 1, 0);//Функция отображения закрашенного прямоугольника градиентным цветом из таблицы TGradColor или TGradColorFlash
	Lcd_Grad_FillRect(1, 0, 225, 320, 15, 10, 1, 1);//Функция отображения закрашенного прямоугольника градиентным цветом из таблицы TGradColor или TGradColorFlash

	Lcd_FillEquilateralTriangle(160, 120, 60, 0, 4);//Функция отображения закрашенного равностороннего треугольника
	Lcd_FillEquilateralTriangle(160, 120, 60, 1, 4);//Функция отображения закрашенного равностороннего треугольника
	Lcd_FillEquilateralTriangle(160, 120, 60, 2, 4);//Функция отображения закрашенного равностороннего треугольника
	Lcd_FillEquilateralTriangle(160, 120, 60, 3, 4);//Функция отображения закрашенного равностороннего треугольника
	Lcd_LineEquilateralTriangle(159, 119, 75, 0, 5, 1);//Функция отображения равностороннего треугольника толщиной в одну или две или три точки
	Lcd_LineEquilateralTriangle(159, 119, 75, 1, 5, 1);//Функция отображения равностороннего треугольника толщиной в одну или две или три точки
	Lcd_LineEquilateralTriangle(159, 119, 75, 2, 5, 1);//Функция отображения равностороннего треугольника толщиной в одну или две или три точки
	Lcd_LineEquilateralTriangle(159, 119, 75, 3, 5, 1);//Функция отображения равностороннего треугольника толщиной в одну или две или три точки

	Lcd_Text_Format(1, 1, str_KVB_en, 1, 110, 138, 100);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	for(i = 14; i < 225; i += 5) Lcd_Line1(0, i, (i * 1.33) - 15, 225, 5);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 225; i > 14; i -= 5) Lcd_Line1(319, i, (i * 1.33) + 15, 15, 5);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 225; i > 14; i -= 5) Lcd_Line1(0, i, 305 - (i * 1.33), 15, 6);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 14; i < 225; i += 5) Lcd_Line1(319, i, 334 - (i * 1.33), 224, 6);//Функции отображения линии толщиной в одну точку (1x1)
	KVB_Delay(4000);
//===========================================================================================
//						Демонстрируем отображение прямых линий
//===========================================================================================
	Lcd_Grad_Fill_Screen(1, 7, 1, 1);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	for(i = 0; i <= 32; i++) Lcd_Line1(0, 0, i * 10, 240, 5);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 31; i > 0; i--) Lcd_Line1(0, 0, 320, i * 8 - 8, 5);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 32; i > 0; i--) Lcd_Line1(320, 240, i * 10, 0, 6);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 0; i <= 30; i++) Lcd_Line1(320, 240, 0, i * 8, 6);//Функции отображения линии толщиной в одну точку (1x1)
	KVB_Delay(3000);
	
	Lcd_Grad_Fill_Screen(1, 9, 1, 0);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	for(i = 32; i > 0; i--) Lcd_Line1(320, 240, i * 10, 0, 5);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 0; i <= 30; i++) Lcd_Line1(320, 240, 0, i * 8, 5);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 0; i <= 32; i++) Lcd_Line1(0, 0, i * 10, 240, 6);//Функции отображения линии толщиной в одну точку (1x1)
	for(i = 31; i > 0; i--) Lcd_Line1(0, 0, 320, i * 8 - 8, 6);//Функции отображения линии толщиной в одну точку (1x1)
	KVB_Delay(3000);
//===========================================================================================
//				Демонстрируем отображение вогнутого и выпуклого ромба
//===========================================================================================
	Lcd_Grad_Fill_Screen(1, 9, 2, 2);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	uint8_t cx = 160;
	uint8_t cy = 120;
	uint16_t size = 120;
	uint8_t step = 6;
	Lcd_Line1(cx - size, cy, cx + size, cy, 5); // Горизонталь Функции отображения линии толщиной в одну точку (1x1)
	for (uint16_t i = 0; i < size; i += step)
	{
		// Линии между осями X и Y в четырех квадрантах
		Lcd_Line1(cx + i, cy, cx, cy + (size - i), 5); // Верх-правый Функции отображения линии толщиной в одну точку (1x1)
		Lcd_Line1(cx - i, cy, cx, cy + (size - i), 5); // Верх-левый Функции отображения линии толщиной в одну точку (1x1)
		Lcd_Line1(cx + i, cy, cx, cy - (size - i), 5); // Низ-правый Функции отображения линии толщиной в одну точку (1x1)
		Lcd_Line1(cx - i, cy, cx, cy - (size - i), 5); // Низ-левый Функции отображения линии толщиной в одну точку (1x1)
	}

	cx = 40;
	cy = 0;
	size = 240;
	step = 6;
	for (uint16_t i = 0; i <= size; i += step)
	{
		uint16_t j = size - i;
		// Соединяем точки на смежных сторонах квадрата
		Lcd_Line1(cx + i, cy, cx + size, cy + i, 6);		// Верх-правый Функции отображения линии толщиной в одну точку (1x1)
		Lcd_Line1(cx + size, cy + i, cx + j, cy + size, 6);	// Низ-правый Функции отображения линии толщиной в одну точку (1x1)
		Lcd_Line1(cx + j, cy + size, cx, cy + j, 6);		// Низ-левый Функции отображения линии толщиной в одну точку (1x1)
		Lcd_Line1(cx, cy + j, cx + i, cy, 6);				// Верх-левый Функции отображения линии толщиной в одну точку (1x1)
	}
	KVB_Delay(4000);
//===========================================================================================
//						Отображаем простые графические примитивы
//===========================================================================================
	Lcd_Grad_Fill_Screen(1, 0, 0, 3);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash

	Lcd_FillRect(15, 30, 80, 60, 2);//Закрашенный прямоугольник
	Lcd_BorderRect(1, 120, 30, 80, 60, 4, 2, 6);//Прямоугольник c окантовкой и заливкой внутри
	Lcd_BorderRect(0, 225, 30, 80, 60, 4, 2, 6);//Прямоугольник c окантовкой и заливкой внутри

	Lcd_FillCircle(55, 180, 38, 2);//Закрашенная окружность
	Lcd_BorderCircle(1, 160, 180, 38, 4, 2, 6);//Окружность c окантовкой и заливкой внутри
	Lcd_BorderCircle(0, 265, 180, 38, 4, 2, 6);//Окружность c окантовкой и заливкой внутри

	KVB_Delay(2000);
	//===========================================================================================
	Lcd_Grad_Fill_Screen(1, 0, 0, 3);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash

	Lcd_FillRoundRect(15, 30, 80, 60, 15, 2);//Закрашенный округлый прямоугольник
	Lcd_BorderRoundRect(1, 120, 30, 80, 60, 15, 4, 2, 6);//Округлый прямоугольник c окантовкой и заливкой внутри
	Lcd_BorderRoundRect(0, 225, 30, 80, 60, 15, 4, 2, 6);//Округлый прямоугольник c окантовкой и заливкой внутри

	Lcd_FillEquilateralTriangle(55, 180, 45, 0, 2);//Функция отображения закрашенного равностороннего треугольника
	Lcd_BorderEquilateralTriangle(1, 160, 180, 45, 4, 0, 2, 6);//Функция отображения равностороннего треугольника  c окантовкой и заливкой внутри
	Lcd_BorderEquilateralTriangle(0, 265, 180, 45, 4, 0, 2, 6);//Функция отображения равностороннего треугольника  c окантовкой и заливкой внутри

	KVB_Delay(2000);
	//===========================================================================================
	Lcd_Grad_Fill_Screen(1, 0, 0, 3);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash

	Lcd_FillEllipse(55, 60, 45, 30, 2);//Закрашенный эллипс
	Lcd_BorderEllipse(1, 160, 60, 45, 30, 4, 2, 6);//Эллипс c окантовкой и заливкой внутри
	Lcd_BorderEllipse(0, 265, 60, 45, 30, 4, 2, 6);//Эллипс c окантовкой и заливкой внутри

	Lcd_FillEllipseRect(15, 150, 80, 60, 30, 21, 2);//Закрашенный округлый прямоугольник на основе эллипса
	Lcd_BorderEllipseRect(1, 120, 150, 80, 60, 30, 21, 4, 2, 6);//Округлый прямоугольник на основе эллипса c окантовкой и заливкой внутри
	Lcd_BorderEllipseRect(0, 225, 150, 80, 60, 30, 21, 4, 2, 6);//Округлый прямоугольник на основе эллипса c окантовкой и заливкой внутри

	KVB_Delay(2000);
//===========================================================================================
//	Отображения многофункционального трех поверхностного объекта Lcd_Multi_three_Round
//===========================================================================================
	Lcd_Fill_Screen(0);//Функция заливки экрана LCD панели одним цветом по индексу таблицы TColorHL
//===========================================================================================
	lcd_Set_Font(KVB_14x28_Nu_ter_bold);//Функция установки отображаемого шрифта
	lcd_Set_Transparent_Font(1);//Функция установки подложки шрифта: 0 - не прозрачная подложка, 1 - прозрачная подложка
	lcd_Set_Edging_Font(1);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	lcd_Set_Scale_Font(1);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения (работает только если Transparent = 0 или 2)
	lcd_Set_Kerning_Font(0);//Функция установки кернинга шрифта (меж символьное расстояние) с коррекцией длины табуляции
	lcd_Set_Spacing_Font(0);//Функция установки расстояния между строками
	lcd_Set_Aligning_Font(1);//Функция выравнивания строки текста 0 : Выравнивание по левому краю, 1 : Выравнивание по центру, 2 : Выравнивание по правому краю
//===========================================================================================
	Lcd_Multi_three_Round(0, 1, 74, 4, 52, 52, 26, 5, 2, 2, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 134, 4, 52, 52, 26, 5, 2, 2, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 194, 4, 52, 52, 26, 5, 2, 2, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(8);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 6, str_nu1, 1, 74, 39, 52);//1 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 6, str_nu2, 1, 134, 39, 52);//2 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 6, str_nu3, 1, 194, 39, 52);//3 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	Lcd_Multi_three_Round(0, 2, 74, 64, 52, 52, 26, 5, 2, 2, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 3, 134, 64, 52, 52, 26, 5, 2, 2, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 4, 194, 64, 52, 52, 26, 5, 2, 2, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(9);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 6, str_nu4, 1, 74, 99, 52);//4 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(10);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 6, str_nu5, 1, 134, 99, 52);//5 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(11);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 6, str_nu6, 1, 194, 99, 52);//6 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	Lcd_Multi_three_Round(0, 5, 74, 124, 52, 52, 26, 5, 2, 2, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 6, 134, 124, 52, 52, 26, 5, 2, 2, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 7, 194, 124, 52, 52, 26, 5, 2, 2, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(12);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 6, str_nu7, 1, 74, 159, 52);//7 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(13);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 6, str_nu8, 1, 134, 159, 52);//8 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(14);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 6, str_nu9, 1, 194, 159, 52);//9 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	Lcd_Multi_three_Round(0, 1, 74, 184, 52, 52, 26, 5, 2, 2, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 134, 184, 52, 52, 26, 5, 2, 2, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 194, 184, 52, 52, 26, 5, 2, 2, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(8);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 6, str_nu0, 1, 74, 219, 52);//0 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 6, str_nu10, 1, 134, 219, 52);//# Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 6, str_nu11, 1, 194, 219, 52);//* Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	//-------------------------------------------------------------------------------------------
	KVB_Delay(500);
	Lcd_Multi_three_Round(0, 8, 74, 4, 52, 52, 26, 5, 2, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(300);
	Lcd_Multi_three_Round(0, 9, 74, 4, 52, 52, 26, 5, 2, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	//-------------------------------------------------------------------------------------------
	KVB_Delay(150);
	Lcd_Multi_three_Round(0, 1, 74, 4, 52, 52, 26, 5, 2, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(500);
	Lcd_Multi_three_Round(0, 8, 134, 4, 52, 52, 26, 5, 2, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(300);
	Lcd_Multi_three_Round(0, 9, 134, 4, 52, 52, 26, 5, 2, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	//-------------------------------------------------------------------------------------------
	KVB_Delay(150);
	Lcd_Multi_three_Round(0, 1, 134, 4, 52, 52, 26, 5, 2, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(500);
	Lcd_Multi_three_Round(0, 8, 194, 4, 52, 52, 26, 5, 2, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(300);
	Lcd_Multi_three_Round(0, 9, 194, 4, 52, 52, 26, 5, 2, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	//-------------------------------------------------------------------------------------------
	KVB_Delay(150);
	Lcd_Multi_three_Round(0, 1, 194, 4, 52, 52, 26, 5, 2, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(500);
	Lcd_Multi_three_Round(0, 8, 74, 64, 52, 52, 26, 5, 2, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(300);
	Lcd_Multi_three_Round(0, 11, 74, 64, 52, 52, 26, 5, 2, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	//-------------------------------------------------------------------------------------------
	KVB_Delay(150);
	Lcd_Multi_three_Round(0, 2, 74, 64, 52, 52, 26, 5, 2, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(500);
	Lcd_Multi_three_Round(0, 8, 134, 64, 52, 52, 26, 5, 2, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(300);
	Lcd_Multi_three_Round(0, 9, 134, 64, 52, 52, 26, 5, 2, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	//-------------------------------------------------------------------------------------------
	KVB_Delay(150);
	Lcd_Multi_three_Round(0, 3, 134, 64, 52, 52, 26, 5, 2, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(500);
	Lcd_Multi_three_Round(0, 8, 194, 64, 52, 52, 26, 5, 2, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(300);
	Lcd_Multi_three_Round(0, 9, 194, 64, 52, 52, 26, 5, 2, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(150);
	Lcd_Multi_three_Round(0, 4, 194, 64, 52, 52, 26, 5, 2, 0, 0, 0, 3, 0, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	KVB_Delay(1000);
//===========================================================================================
	Lcd_Fill_Screen(0);//Функция заливки экрана LCD панели одним цветом по индексу таблицы TColorHL
	Lcd_Multi_three_Round(0, 1, 74, 4, 52, 52, 26, 4, 2, 4, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 134, 4, 52, 52, 26, 4, 2, 4, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 194, 4, 52, 52, 26, 4, 2, 4, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 4, str_nu1, 1, 74, 39, 52);//1 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 4, str_nu2, 1, 134, 39, 52);//2 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 4, str_nu3, 1, 194, 39, 52);//3 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	Lcd_Multi_three_Round(0, 2, 74, 64, 52, 52, 26, 4, 2, 4, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 3, 134, 64, 52, 52, 26, 4, 2, 4, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 4, 194, 64, 52, 52, 26, 4, 2, 4, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(2);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 4, str_nu4, 1, 74, 99, 52);//4 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(3);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 4, str_nu5, 1, 134, 99, 52);//5 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(4);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 4, str_nu6, 1, 194, 99, 52);//6 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	Lcd_Multi_three_Round(0, 5, 74, 124, 52, 52, 26, 4, 2, 4, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 6, 134, 124, 52, 52, 26, 4, 2, 4, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 7, 194, 124, 52, 52, 26, 4, 2, 4, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(5);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 4, str_nu7, 1, 74, 159, 52);//7 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(6);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 4, str_nu8, 1, 134, 159, 52);//8 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(7);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 4, str_nu9, 1, 194, 159, 52);//9 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	Lcd_Multi_three_Round(0, 1, 74, 184, 52, 52, 26, 4, 2, 4, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 134, 184, 52, 52, 26, 4, 2, 4, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 194, 184, 52, 52, 26, 4, 2, 4, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 4, str_nu0, 1, 74, 219, 52);//0 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 4, str_nu10, 1, 134, 219, 52);//# Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 4, str_nu11, 1, 194, 219, 52);//* Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	KVB_Delay(4000);
//===========================================================================================
	Lcd_Fill_Screen(0);//Функция заливки экрана LCD панели одним цветом по индексу таблицы TColorHL
	Lcd_Multi_three_Round(0, 1, 74, 4, 52, 52, 26, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 134, 4, 52, 52, 26, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 194, 4, 52, 52, 26, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Text_Format(0, 3, str_nu1, 1, 74, 39, 52);//1 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 3, str_nu2, 1, 134, 39, 52);//2 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 3, str_nu3, 1, 194, 39, 52);//3 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	Lcd_Multi_three_Round(0, 2, 74, 64, 52, 52, 26, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 3, 134, 64, 52, 52, 26, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 4, 194, 64, 52, 52, 26, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(2);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu4, 1, 74, 99, 52);//4 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(3);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu5, 1, 134, 99, 52);//5 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(4);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu6, 1, 194, 99, 52);//6 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	Lcd_Multi_three_Round(0, 5, 74, 124, 52, 52, 26, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 6, 134, 124, 52, 52, 26, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 7, 194, 124, 52, 52, 26, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(5);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu7, 1, 74, 159, 52);//7 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(6);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu8, 1, 134, 159, 52);//8 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(7);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu9, 1, 194, 159, 52);//9 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	Lcd_Multi_three_Round(0, 1, 74, 184, 52, 52, 26, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 134, 184, 52, 52, 26, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 194, 184, 52, 52, 26, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu0, 1, 74, 219, 52);//0 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 3, str_nu10, 1, 134, 219, 52);//# Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 3, str_nu11, 1, 194, 219, 52);//* Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	KVB_Delay(2000);
//===========================================================================================
	Lcd_Fill_Screen(0);//Функция заливки экрана LCD панели одним цветом по индексу таблицы TColorHL
	Lcd_Multi_three_Round(0, 1, 74, 4, 52, 52, 15, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 134, 4, 52, 52, 15, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 194, 4, 52, 52, 15, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu1, 1, 74, 39, 52);//1 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 3, str_nu2, 1, 134, 39, 52);//2 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 3, str_nu3, 1, 194, 39, 52);//3 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	Lcd_Multi_three_Round(0, 2, 74, 64, 52, 52, 15, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 3, 134, 64, 52, 52, 15, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 4, 194, 64, 52, 52, 15, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(2);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu4, 1, 74, 99, 52);//4 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(3);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu5, 1, 134, 99, 52);//5 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(4);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu6, 1, 194, 99, 52);//6 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	Lcd_Multi_three_Round(0, 5, 74, 124, 52, 52, 15, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 6, 134, 124, 52, 52, 15, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 7, 194, 124, 52, 52, 15, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(5);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu7, 1, 74, 159, 52);//7 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(6);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu8, 1, 134, 159, 52);//8 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Grad_Color_MultiRoundPrintFlash(7);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu9, 1, 194, 159, 52);//9 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием

	Lcd_Multi_three_Round(0, 1, 74, 184, 52, 52, 15, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 134, 184, 52, 52, 15, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0, 1, 194, 184, 52, 52, 15, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_nu0, 1, 74, 219, 52);//0 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 3, str_nu10, 1, 134, 219, 52);//# Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 3, str_nu11, 1, 194, 219, 52);//* Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	KVB_Delay(5000);
//===========================================================================================
//							Печать и форматирование текста
//===========================================================================================
	Lcd_Fill_Screen(0);//Функция заливки экрана LCD панели одним цветом по индексу таблицы TColorHL
//===========================================================================================
	//lcd_Set_Font(KVB_5x12_ER_sans_normal);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_6x12_ER_ter_normal);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_7x12_ER_sans_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_8x14_ER_serif_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_8x14_ER_ter_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_8x14_ER_ter_normal);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_8x16_ER_serif_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_8x16_ER_ter_bold);//Функция установки отображаемого шрифта
	lcd_Set_Font(KVB_8x16_ER_ter_normal);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_10x18_ER_serif_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_10x18_ER_ter_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_10x18_ER_ter_normal);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_10x20_ER_serif_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_10x20_ER_ter_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_10x20_ER_ter_normal);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_11x22_ER_ter_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_11x22_ER_ter_normal);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_12x24_ER_ter_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_12x24_ER_ter_normal);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_14x28_ER_ter_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_14x28_ER_ter_normal);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_16x32_ER_ter_bold);//Функция установки отображаемого шрифта
	//lcd_Set_Font(KVB_16x32_ER_ter_normal);//Функция установки отображаемого шрифта
//===========================================================================================
	lcd_Set_Kerning_Font(0);//Функция установки кернинга шрифта (меж символьное расстояние) с коррекцией длины табуляции
	lcd_Set_Spacing_Font(2);//Функция установки расстояния между строками
	lcd_Set_Transparent_Font(0);//Функция установки подложки шрифта: 0 - не прозрачная подложка, 1 - прозрачная подложка
	lcd_Set_Aligning_Font(0);//Функция выравнивания строки текста 0 : Выравнивание по левому краю, 1 : Выравнивание по центру, 2 : Выравнивание по правому краю
	lcd_Set_Edging_Font(0);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	lcd_Set_Scale_Font(1);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения (работает только если Transparent = 0 или 2)
//===========================================================================================
	lcd_Set_Color_Font_RGB(0, 0, 0, 0, 0, 0, 1);//Цвета подложки
	lcd_Set_Color_Font_RGB(250, 250, 0, 0, 250, 250, 0);//Цвета символов
	lcd_Set_Scale_Font(2);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения
	lcd_Set_Aligning_Font(1);//Функция выравнивания строки текста 0 : Выравнивание по левому краю, 1 : Выравнивание по центру, 2 : Выравнивание по правому краю
	Lcd_Text_Format(0, 1, str_test1a_ru, 1, 5, 30, 310);//Перенос по словам Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Scale_Font(1);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения
	lcd_Set_Aligning_Font(0);//Функция выравнивания строки текста 0 : Выравнивание по левому краю, 1 : Выравнивание по центру, 2 : Выравнивание по правому краю
	Lcd_Text_Format(0, 2, str_test1_ru, 1, 5, 60, 310);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 1, str_test1_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 2, str_test1_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 1, str_test2_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	double sdf = -2350.651;
	lcd_Set_Color_Font_RGB(250, 250, 0, 140, 255, 140, 0);//Цвета символов
	Lcd_Text_NumberF(0, 2, sdf, 0, 0, 0, 3, ',', 12, '0');//Функция вывода на дисплей вещественного числа или содержимое переменной вещественного типа
	Lcd_Text_Format(0, 1, str_test1_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 1, str_test1_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	KVB_Delay(4000);
//===========================================================================================
	lcd_Set_TGradColor_RGB(100,0,200,255,100,100,0);//Функция установки градиента цвета в таблицу TGradColor из формата RGB по индексу
	Lcd_Grad_Fill_Screen(0, 0, 0, 3);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	lcd_Set_Color_Font_RGB(0, 0, 0, 0, 0, 0, 2);//Цвета окантовки (тени)
	lcd_Set_Color_Font_RGB(250, 250, 0, 0, 250, 250, 0);//Цвета символов
	lcd_Set_Transparent_Font(1);//Функция установки подложки шрифта: 0 - не прозрачная подложка, 1 - прозрачная подложка
	lcd_Set_Scale_Font(2);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения
	lcd_Set_Aligning_Font(1);//Функция выравнивания строки текста 0 : Выравнивание по левому краю, 1 : Выравнивание по центру, 2 : Выравнивание по правому краю
	Lcd_Text_Format(0, 1, str_test1a_ru, 1, 5, 30, 310);//Перенос по словам Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Scale_Font(1);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения
	lcd_Set_Aligning_Font(0);//Функция выравнивания строки текста 0 : Выравнивание по левому краю, 1 : Выравнивание по центру, 2 : Выравнивание по правому краю
	Lcd_Text_Format(0, 2, str_test1_ru, 1, 5, 60, 310);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 1, str_test1_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 2, str_test1_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 1, str_test2_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Color_Font_RGB(250, 250, 0, 140, 255, 140, 0);//Цвета символов
	Lcd_Text_NumberF(0, 2, sdf, 0, 0, 0, 3, ',', 12, '0');//Функция вывода на дисплей вещественного числа или содержимое переменной вещественного типа
	Lcd_Text_Format(0, 1, str_test1_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 1, str_test1_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	KVB_Delay(4000);
//===========================================================================================
	lcd_Set_Color_Font_RGB(250, 250, 0, 0, 250, 250, 0);//Цвета символов;
	Lcd_Grad_Fill_Screen(0, 0, 0, 3);//Функция заливки экрана LCD панели градиентным цветом по индексу цвета из таблицы TGradColor или TGradColorFlash
	lcd_Set_Scale_Font(2);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения
	lcd_Set_Aligning_Font(1);//Функция выравнивания строки текста 0 : Выравнивание по левому краю, 1 : Выравнивание по центру, 2 : Выравнивание по правому краю
	lcd_Set_Edging_Font(5);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	lcd_Set_Color_Font_RGB(250, 250, 0, 0, 250, 250, 2);//Цвета окантовки шрифта
	lcd_Set_Kerning_Font(3);//Функция установки кернинга шрифта (меж символьное расстояние) с коррекцией длины табуляции
	Lcd_Text_Format(0, 0, str_test1b_ru, 1, 5, 30, 310);//Текст с тенью Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Kerning_Font(0);//Функция установки кернинга шрифта (меж символьное расстояние) с коррекцией длины табуляции
	lcd_Set_Color_Font_RGB(0, 0, 0, 0, 0, 0, 2);//Цвета окантовки шрифта
	lcd_Set_Scale_Font(1);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения
	lcd_Set_Aligning_Font(0);//Функция выравнивания строки текста 0 : Выравнивание по левому краю, 1 : Выравнивание по центру, 2 : Выравнивание по правому краю
	lcd_Set_Edging_Font(1);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	Lcd_Text_Format(0, 2, str_test1_ru, 1, 5, 60, 310);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 1, str_test1_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 2, str_test1_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 1, str_test2_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	lcd_Set_Color_Font_RGB(250, 250, 0, 140, 255, 140, 0);//Цвета символов
	Lcd_Text_NumberF(0, 2, sdf, 0, 0, 0, 3, ',', 12, '0');//Функция вывода на дисплей вещественного числа или содержимое переменной вещественного типа
	Lcd_Text_Format(0, 1, str_test1_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	Lcd_Text_Format(0, 1, str_test1_ru, 1, 0, 0, 0);//Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
	KVB_Delay(4000);
//===========================================================================================
//						Последняя страница отображения LCD панели
//===========================================================================================
	lcd_Set_TColor_RGB(0, 0, 0, 0);//Функция установки цветов в таблицу TColorHL из формата RGB по индексу
	Lcd_Fill_Screen(0);//Функция заливки экрана LCD панели одним цветом по индексу
	//-------------------------------------------------------------------------------------------
	lcd_Set_Font(KVB_10x18_ER_ter_bold);//Функция установки отображаемого шрифта
	lcd_Set_Edging_Font(1);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	lcd_Set_Scale_Font(1);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения (работает только если Transparent = 0 или 2)
	lcd_Set_Aligning_Font(1);//Функция выравнивания строки текста 0 : Выравнивание по левому краю, 1 : Выравнивание по центру, 2 : Выравнивание по правому краю
//-------------------------------------------------------------------------------------------
//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	Lcd_Multi_three_Round(0,//Формат визуализации 0 = вертикальный, 1 = горизонтальный
					1,	//Индекс цвета кнопки из программной памяти начиная с 1, если 0 то из оперативной памяти
//---------------------------------------------------------------------------
					4,	//Верхняя левая точка начала объекта по оси X (горизонтали)
					0,	//Верхняя левая точка начала объекта по оси Y (вертикали)
					72,//Ширина объекта
					38,	//Высота объекта
//---------------------------------------------------------------------------
					11,	//Наружный радиус окружности
					5,	//Формат отображения внешней поверхности: 0 = не отображать, 1 = светлый цвет, 2 = темный цвет, 3 = линейный градиент от темного к светлому, 4 = линейный градиент от светлого к темному, 5 = центральный градиент от темного к светлому и обратно к темному, 6 = центральный градиент от светлого к темному и обратно к светлому
//---------------------------------------------------------------------------
					2,	//Окантовка - бордюр от наружного радиуса внутрь, если 0 то не отображается
					5,	//Формат отображения внутренней поверхности: 0 = не отображать, 1 = светлый цвет, 2 = темный цвет, 3 = вертикальный градиент от темного к светлому, 4 = вертикальный градиент от светлого к темному, 5 = центральный градиент от темного к светлому и обратно к темному, 6 = центральный градиент от светлого к темному и обратно к светлому
					0,	//Смещение внутренней поверхности по оси X
					0,	//Смещение внутренней поверхности по оси Y
//---------------------------------------------------------------------------
					3,	//Окантовка - бордюр от наружного радиуса внутрь, если 0 то не отображается
					6,	//Формат отображения внутренней поверхности: 0 = не отображать, 1 = светлый цвет, 2 = темный цвет, 3 = линейный градиент от темного к светлому, 4 = линейный градиент от светлого к темному, 5 = центральный градиент от темного к светлому и обратно к темному, 6 = центральный градиент от светлого к темному и обратно к светлому
					0,	//Смещение внутренней поверхности по оси X
					0);	//Смещение внутренней поверхности по оси Y
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 6, str_button1_ru, 1, 4, 24, 72);//ВВЕРХ Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
//-------------------------------------------------------------------------------------------
	Lcd_Multi_three_Round(1, 1, 84, 0, 72, 38, 11, 5, 2, 5, 0, 0, 3, 6, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(1, 6, str_button2_ru, 1, 84, 24, 72);//ВИДЕО Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
//-------------------------------------------------------------------------------------------
	Lcd_Multi_three_Round(0, 1, 164, 0, 72, 38, 11, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(0, 3, str_button3_ru, 1, 164, 24, 72);//НАЗАД Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
//-------------------------------------------------------------------------------------------
	Lcd_Multi_three_Round(1, 1, 244, 0, 72, 38, 11, 3, 2, 4, 0, 0, 3, 4, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	Lcd_Text_Format(1, 3, str_button4_ru, 1, 244, 24, 72);//СБРОС Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
//-------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------
	Lcd_Multi_three_Round(0, 1, 4, 46, 72, 38, 11, 6, 2, 6, 0, 0, 3, 5, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	lcd_Set_Edging_Font(3);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	Lcd_Text_Format(0, 5, str_button5_ru, 1, 4, 70, 72);//ВНИЗ Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
//-------------------------------------------------------------------------------------------
	Lcd_Multi_three_Round(1, 1, 84, 46, 72, 38, 11, 6, 2, 6, 0, 0, 3, 5, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	lcd_Set_Edging_Font(3);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	Lcd_Text_Format(1, 5, str_button6_ru, 1, 84, 70, 72);//СТАРТ Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
//-------------------------------------------------------------------------------------------
	Lcd_Multi_three_Round(0, 1, 164, 46, 72, 38, 11, 4, 2, 3, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	lcd_Set_Edging_Font(3);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	Lcd_Text_Format(0, 4, str_button7_ru, 1, 164, 70, 72);//ЗВУКИ Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
//-------------------------------------------------------------------------------------------
	Lcd_Multi_three_Round(1, 1, 244, 46, 72, 38, 11, 4, 2, 3, 0, 0, 3, 3, 0, 0);//Функция отображения многофункционального трех поверхностного объекта с аппаратной поддержкой LCD панели
	lcd_Set_Grad_Color_MultiRoundPrintFlash(1);//Функция установки градиентных цветов для печати текста на многофункциональном трех поверхностном объекте по соответствующему индексу
	lcd_Set_Edging_Font(2);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	Lcd_Text_Format(1, 4, str_button8_ru, 1, 244, 70, 72);//АУДИО Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
//-------------------------------------------------------------------------------------------
	lcd_Set_Spacing_Font(-5);//Функция установки расстояния между строками
	lcd_Set_Edging_Font(0);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	lcd_Set_Scale_Font(2);//Функция установки коэффициента увеличения шрифта, 0 или 1 - нет увеличения

	lcd_Set_Color_Font_RGB(255, 150, 0, 0, 150, 255, 0);//Цвета символов
	lcd_Set_Color_Font_RGB(190, 0, 0, 0, 30, 180, 1);//Цвета подложки
	lcd_Set_Color_Font_RGB(200, 200, 200, 200, 200, 200, 2);//Цвета окантовки (тени)

	Lcd_Text_Format(1, 5, str_LCD_en, 1, 1, 140, 320);//KVB-16bit-ILI9481\nATmega128A Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
//-------------------------------------------------------------------------------------------
	lcd_Set_Color_Font_RGB(0, 100, 255, 255, 0, 0, 0);//Цвета символов
	lcd_Set_Edging_Font(5);//Функция установки окантовки шрифта: (0 = нет окантовки, 1 = тень низ справа, 2 = тень низ слева, 3 = тень верх справа, 4 = тень верх слева, 5 = круговая окантовка)
	lcd_Set_Kerning_Font(2);//Функция установки кернинга шрифта (меж символьное расстояние) с коррекцией длины табуляции
	Lcd_Text_Format(0, 3, str_IDE_en, 1, 1, 220, 320);//Atmel Studio 7 Функция вывода на дисплей форматированного текста с переносом по словам и выравниванием
//-------------------------------------------------------------------------------------------
	KVB_Delay(4000);
//===========================================================================================
//						Переводим LCD панель в спящий режим и обратно
//===========================================================================================
	lcd_Display_Off();//Функция отключения дисплея (Вход в режим энергосбережения)
	KVB_Delay(2000);
	lcd_Display_On();//Функция включения дисплея (Выход из режима сна)
	KVB_Delay(500);
}
//###########################################################################################


